ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F120_GQ
//  C8051F121_GQ
//  C8051F122_GQ
//  C8051F123_GQ
//  C8051F124_GQ
//  C8051F125_GQ
//  C8051F126_GQ
//  C8051F127_GQ
//  C8051F130_GQ
//  C8051F131_GQ
//  C8051F132_GQ
//  C8051F133_GQ

#ifndef SI_C8051F120_REGISTER_ENUMS_H
#define SI_C8051F120_REGISTER_ENUMS_H

//Standard device includes
#include "SI_C8051F120_Defs.h"
//------------------------------------------------------------------------------
// ADC2 Enums (ADC2 Data Word @ 0xBE)
//------------------------------------------------------------------------------
#define ADC2_ADC2H__FMASK 0xFF ///< Data Word
#define ADC2_ADC2H__SHIFT 0x00 ///< Data Word
                                             
//------------------------------------------------------------------------------
// ADC2CF Enums (ADC2 Configuration @ 0xBC)
//------------------------------------------------------------------------------
#define ADC2CF_AMP2GN__FMASK    0x03 ///< ADC2 Internal Amplifier Gain (PGA)
#define ADC2CF_AMP2GN__SHIFT    0x00 ///< ADC2 Internal Amplifier Gain (PGA)
#define ADC2CF_AMP2GN__GAIN_0P5 0x00 ///< The on-chip PGA gain is 0.5.      
#define ADC2CF_AMP2GN__GAIN_1   0x01 ///< The on-chip PGA gain is 1.        
#define ADC2CF_AMP2GN__GAIN_2   0x02 ///< The on-chip PGA gain is 2.        
#define ADC2CF_AMP2GN__GAIN_4   0x03 ///< The on-chip PGA gain is 4.        
                                                                            
#define ADC2CF_AD2SC__FMASK     0xF8 ///< SAR Clock Divider                 
#define ADC2CF_AD2SC__SHIFT     0x03 ///< SAR Clock Divider                 
                                                                            
//------------------------------------------------------------------------------
// ADC2CN Enums (ADC2 Control @ 0xE8)
//------------------------------------------------------------------------------
#define ADC2CN_ADWINT__BMASK     0x01 ///< Window Compare Interrupt Flag                     
#define ADC2CN_ADWINT__SHIFT     0x00 ///< Window Compare Interrupt Flag                     
#define ADC2CN_ADWINT__NOT_SET   0x00 ///< An ADC window compare event did not occur.        
#define ADC2CN_ADWINT__SET       0x01 ///< An ADC window compare event occurred.             
                                                                                             
#define ADC2CN_ADCM__FMASK       0x0E ///< Start of Conversion Mode Select                   
#define ADC2CN_ADCM__SHIFT       0x01 ///< Start of Conversion Mode Select                   
#define ADC2CN_ADCM__ADBUSY      0x00 ///< ADC2 conversion initiated on write of 1 to ADBUSY.
#define ADC2CN_ADCM__TIMER3      0x02 ///< ADC2 conversion initiated on overflow of Timer 3. 
#define ADC2CN_ADCM__CNVSTR      0x04 ///< ADC2 conversion initiated on rising edge of       
                                      ///< CNVSTR0.                                          
#define ADC2CN_ADCM__TIMER2      0x06 ///< ADC2 conversion initiated on overflow of Timer 2. 
#define ADC2CN_ADCM__ADC0_ADBUSY 0x08 ///< ADC2 conversion initiated on write of 1 to ADC0's 
                                      ///< ADBUSY.                                           
                                                                                             
#define ADC2CN_ADBUSY__BMASK     0x10 ///< ADC Busy                                          
#define ADC2CN_ADBUSY__SHIFT     0x04 ///< ADC Busy                                          
#define ADC2CN_ADBUSY__NOT_SET   0x00 ///< An ADC2 conversion is not currently in progress.  
#define ADC2CN_ADBUSY__SET       0x10 ///< ADC2 conversion is in progress or start an ADC2   
                                      ///< conversion.                                       
                                                                                             
#define ADC2CN_ADINT__BMASK      0x20 ///< Conversion Complete Interrupt Flag                
#define ADC2CN_ADINT__SHIFT      0x05 ///< Conversion Complete Interrupt Flag                
#define ADC2CN_ADINT__NOT_SET    0x00 ///< ADC2 has not completed a conversion since the last
                                      ///< time ADINT was cleared.                           
#define ADC2CN_ADINT__SET        0x20 ///< ADC2 completed a data conversion.                 
                                                                                             
#define ADC2CN_ADTM__BMASK       0x40 ///< ADC Track Mode                                    
#define ADC2CN_ADTM__SHIFT       0x06 ///< ADC Track Mode                                    
#define ADC2CN_ADTM__CONTINUOUS  0x00 ///< When the ADC is enabled, tracking is continuous   
                                      ///< unless a conversion is in process.                
#define ADC2CN_ADTM__ADJUSTABLE  0x40 ///< Tracking defined by the ADCM field.               
                                                                                             
#define ADC2CN_ADEN__BMASK       0x80 ///< ADC Enable                                        
#define ADC2CN_ADEN__SHIFT       0x07 ///< ADC Enable                                        
#define ADC2CN_ADEN__DISABLED    0x00 ///< Disable ADC2 (low-power shutdown).                
#define ADC2CN_ADEN__ENABLED     0x80 ///< Enable ADC2 (active and ready for data            
                                      ///< conversions).                                     
                                                                                             
//------------------------------------------------------------------------------
// ADC2GT Enums (ADC2 Greater-Than Data Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC2GT_ADC2GTH__FMASK 0xFF ///< Greater-Than Byte
#define ADC2GT_ADC2GTH__SHIFT 0x00 ///< Greater-Than Byte
                                                         
//------------------------------------------------------------------------------
// ADC2LT Enums (ADC2 Less-Than Data Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC2LT_ADC2LTH__FMASK 0xFF ///< Less-Than Data Byte
#define ADC2LT_ADC2LTH__SHIFT 0x00 ///< Less-Than Data Byte
                                                           
//------------------------------------------------------------------------------
// AMX2CF Enums (AMUX2 Configuration @ 0xBA)
//------------------------------------------------------------------------------
#define AMX2CF_AIN01IC__BMASK        0x01 ///< AIN2.0, AIN2.1 Input Pair Configuration         
#define AMX2CF_AIN01IC__SHIFT        0x00 ///< AIN2.0, AIN2.1 Input Pair Configuration         
#define AMX2CF_AIN01IC__SINGLE_ENDED 0x00 ///< AIN2.0 and AIN2.1 are independent single-ended  
                                          ///< inputs.                                         
#define AMX2CF_AIN01IC__DIFFERENTIAL 0x01 ///< AIN2.0 and AIN2.1 are a (respectively) positive,
                                          ///< negative differential input pair.               
                                                                                               
#define AMX2CF_AIN23IC__BMASK        0x02 ///< AIN2.2, AIN2.3 Input Pair Configuration         
#define AMX2CF_AIN23IC__SHIFT        0x01 ///< AIN2.2, AIN2.3 Input Pair Configuration         
#define AMX2CF_AIN23IC__SINGLE_ENDED 0x00 ///< AIN2.2 and AIN2.3 are independent single-ended  
                                          ///< inputs.                                         
#define AMX2CF_AIN23IC__DIFFERENTIAL 0x02 ///< AIN2.2 and AIN2.3 are a (respectively) positive,
                                          ///< negative differential input pair.               
                                                                                               
#define AMX2CF_AIN45IC__BMASK        0x04 ///< AIN2.4, AIN2.5 Input Pair Configuration         
#define AMX2CF_AIN45IC__SHIFT        0x02 ///< AIN2.4, AIN2.5 Input Pair Configuration         
#define AMX2CF_AIN45IC__SINGLE_ENDED 0x00 ///< AIN2.4 and AIN2.5 are independent single-ended  
                                          ///< inputs.                                         
#define AMX2CF_AIN45IC__DIFFERENTIAL 0x04 ///< AIN2.4 and AIN2.5 are a (respectively) positive,
                                          ///< negative differential input pair.               
                                                                                               
#define AMX2CF_AIN67IC__BMASK        0x08 ///< AIN2.6, AIN2.7 Input Pair Configuration         
#define AMX2CF_AIN67IC__SHIFT        0x03 ///< AIN2.6, AIN2.7 Input Pair Configuration         
#define AMX2CF_AIN67IC__SINGLE_ENDED 0x00 ///< AIN2.6 and AIN2.7 are independent single-ended  
                                          ///< inputs.                                         
#define AMX2CF_AIN67IC__DIFFERENTIAL 0x08 ///< AIN2.6 and AIN2.7 are a (respectively) positive,
                                          ///< negative differential input pair.               
                                                                                               
//------------------------------------------------------------------------------
// AMX2SL Enums (AMUX2 Channel Select @ 0xBB)
//------------------------------------------------------------------------------
#define AMX2SL_ADC2AD__FMASK  0x07 ///< ADC2 Input Selection
#define AMX2SL_ADC2AD__SHIFT  0x00 ///< ADC2 Input Selection
#define AMX2SL_ADC2AD__ADC2P0 0x00 ///< Select ADC2.0.      
#define AMX2SL_ADC2AD__ADC2P1 0x01 ///< Select ADC2.1.      
#define AMX2SL_ADC2AD__ADC2P2 0x02 ///< Select ADC2.2.      
#define AMX2SL_ADC2AD__ADC2P3 0x03 ///< Select ADC2.3.      
#define AMX2SL_ADC2AD__ADC2P4 0x04 ///< Select ADC2.4.      
#define AMX2SL_ADC2AD__ADC2P5 0x05 ///< Select ADC2.5.      
#define AMX2SL_ADC2AD__ADC2P6 0x06 ///< Select ADC2.6.      
#define AMX2SL_ADC2AD__ADC2P7 0x07 ///< Select ADC2.7.      
                                                            
//------------------------------------------------------------------------------
// ADC0CF Enums (ADC0 Configuration @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0CF_AMP0GN__FMASK    0x07 ///< ADC0 Internal Amplifier Gain (PGA)
#define ADC0CF_AMP0GN__SHIFT    0x00 ///< ADC0 Internal Amplifier Gain (PGA)
#define ADC0CF_AMP0GN__GAIN_1   0x00 ///< The on-chip PGA gain is 1.        
#define ADC0CF_AMP0GN__GAIN_2   0x01 ///< The on-chip PGA gain is 2.        
#define ADC0CF_AMP0GN__GAIN_4   0x02 ///< The on-chip PGA gain is 4.        
#define ADC0CF_AMP0GN__GAIN_8   0x03 ///< The on-chip PGA gain is 8.        
#define ADC0CF_AMP0GN__GAIN_16  0x04 ///< The on-chip PGA gain is 16.       
#define ADC0CF_AMP0GN__GAIN_0P5 0x06 ///< The on-chip PGA gain is 0.5.      
                                                                            
