ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define ADC0CF_AD0SC__FMASK     0xF8 ///< SAR Clock Divider                 
#define ADC0CF_AD0SC__SHIFT     0x03 ///< SAR Clock Divider                 
                                                                            
//------------------------------------------------------------------------------
// ADC0CN Enums (ADC0 Control @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0CN_ADLJST__BMASK           0x01 ///< ADC Left Justify Select                           
#define ADC0CN_ADLJST__SHIFT           0x00 ///< ADC Left Justify Select                           
#define ADC0CN_ADLJST__RIGHT_JUSTIFIED 0x00 ///< Data in the ADC0H:ADC0L registers is right-       
                                            ///< justified.                                        
#define ADC0CN_ADLJST__LEFT_JUSTIFIED  0x01 ///< Data in the ADC0H:ADC0L registers is left-        
                                            ///< justified.                                        
                                                                                                   
#define ADC0CN_ADWINT__BMASK           0x02 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__SHIFT           0x01 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__NOT_SET         0x00 ///< An ADC window compare event did not occur.        
#define ADC0CN_ADWINT__SET             0x02 ///< An ADC window compare event occurred.             
                                                                                                   
#define ADC0CN_ADCM__FMASK             0x0C ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__SHIFT             0x02 ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__ADBUSY            0x00 ///< ADC0 conversion initiated on write of 1 to ADBUSY.
#define ADC0CN_ADCM__TIMER3            0x04 ///< ADC0 conversion initiated on overflow of Timer 3. 
#define ADC0CN_ADCM__CNVSTR            0x08 ///< ADC0 conversion initiated on rising edge of       
                                            ///< CNVSTR0.                                          
#define ADC0CN_ADCM__TIMER2            0x0C ///< ADC0 conversion initiated on overflow of Timer 2. 
                                                                                                   
#define ADC0CN_ADBUSY__BMASK           0x10 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__SHIFT           0x04 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__NOT_SET         0x00 ///< An ADC0 conversion is not currently in progress.  
#define ADC0CN_ADBUSY__SET             0x10 ///< ADC0 conversion is in progress or start an ADC0   
                                            ///< conversion.                                       
                                                                                                   
#define ADC0CN_ADINT__BMASK            0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__SHIFT            0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__NOT_SET          0x00 ///< ADC0 has not completed a conversion since the last
                                            ///< time ADINT was cleared.                           
#define ADC0CN_ADINT__SET              0x20 ///< ADC0 completed a data conversion.                 
                                                                                                   
#define ADC0CN_ADTM__BMASK             0x40 ///< ADC Track Mode                                    
#define ADC0CN_ADTM__SHIFT             0x06 ///< ADC Track Mode                                    
#define ADC0CN_ADTM__CONTINUOUS        0x00 ///< When the ADC is enabled, tracking is continuous   
                                            ///< unless a conversion is in process.                
#define ADC0CN_ADTM__ADJUSTABLE        0x40 ///< Tracking defined by the ADCM field.               
                                                                                                   
#define ADC0CN_ADEN__BMASK             0x80 ///< ADC Enable                                        
#define ADC0CN_ADEN__SHIFT             0x07 ///< ADC Enable                                        
#define ADC0CN_ADEN__DISABLED          0x00 ///< Disable ADC0 (low-power shutdown).                
#define ADC0CN_ADEN__ENABLED           0x80 ///< Enable ADC0 (active and ready for data            
                                            ///< conversions).                                     
                                                                                                   
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBF)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC7)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// AMX0CF Enums (AMUX0 Configuration @ 0xBA)
//------------------------------------------------------------------------------
#define AMX0CF_AIN01IC__BMASK        0x01 ///< AIN0.0, AIN0.1 Input Pair Configuration         
#define AMX0CF_AIN01IC__SHIFT        0x00 ///< AIN0.0, AIN0.1 Input Pair Configuration         
#define AMX0CF_AIN01IC__SINGLE_ENDED 0x00 ///< AIN0.0 and AIN0.1 are independent single-ended  
                                          ///< inputs.                                         
#define AMX0CF_AIN01IC__DIFFERENTIAL 0x01 ///< AIN0.0 and AIN0.1 are a (respectively) positive,
                                          ///< negative differential input pair.               
                                                                                               
#define AMX0CF_AIN23IC__BMASK        0x02 ///< AIN0.2, AIN0.3 Input Pair Configuration         
#define AMX0CF_AIN23IC__SHIFT        0x01 ///< AIN0.2, AIN0.3 Input Pair Configuration         
#define AMX0CF_AIN23IC__SINGLE_ENDED 0x00 ///< AIN0.2 and AIN0.3 are independent single-ended  
                                          ///< inputs.                                         
#define AMX0CF_AIN23IC__DIFFERENTIAL 0x02 ///< AIN0.2 and AIN0.3 are a (respectively) positive,
                                          ///< negative differential input pair.               
                                                                                               
