ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define AMX0CF_AIN45IC__BMASK        0x04 ///< AIN0.4, AIN0.5 Input Pair Configuration         
#define AMX0CF_AIN45IC__SHIFT        0x02 ///< AIN0.4, AIN0.5 Input Pair Configuration         
#define AMX0CF_AIN45IC__SINGLE_ENDED 0x00 ///< AIN0.4 and AIN0.5 are independent single-ended  
                                          ///< inputs.                                         
#define AMX0CF_AIN45IC__DIFFERENTIAL 0x04 ///< AIN0.4 and AIN0.5 are a (respectively) positive,
                                          ///< negative differential input pair.               
                                                                                               
#define AMX0CF_AIN67IC__BMASK        0x08 ///< AIN0.6, AIN0.7 Input Pair Configuration         
#define AMX0CF_AIN67IC__SHIFT        0x03 ///< AIN0.6, AIN0.7 Input Pair Configuration         
#define AMX0CF_AIN67IC__SINGLE_ENDED 0x00 ///< AIN0.6 and AIN0.7 are independent single-ended  
                                          ///< inputs.                                         
#define AMX0CF_AIN67IC__DIFFERENTIAL 0x08 ///< AIN0.6 and AIN0.7 are a (respectively) positive,
                                          ///< negative differential input pair.               
                                                                                               
//------------------------------------------------------------------------------
// AMX0SL Enums (AMUX0 Channel Select @ 0xBB)
//------------------------------------------------------------------------------
#define AMX0SL_ADC0AD__FMASK  0x0F ///< ADC0 Input Selection
#define AMX0SL_ADC0AD__SHIFT  0x00 ///< ADC0 Input Selection
#define AMX0SL_ADC0AD__ADC0P0 0x00 ///< Select ADC0.0.      
#define AMX0SL_ADC0AD__ADC0P1 0x01 ///< Select ADC0.1.      
#define AMX0SL_ADC0AD__ADC0P2 0x02 ///< Select ADC0.2.      
#define AMX0SL_ADC0AD__ADC0P3 0x03 ///< Select ADC0.3.      
#define AMX0SL_ADC0AD__ADC0P4 0x04 ///< Select ADC0.4.      
#define AMX0SL_ADC0AD__ADC0P5 0x05 ///< Select ADC0.5.      
#define AMX0SL_ADC0AD__ADC0P6 0x06 ///< Select ADC0.6.      
#define AMX0SL_ADC0AD__ADC0P7 0x07 ///< Select ADC0.7.      
#define AMX0SL_ADC0AD__TEMP   0x08 ///< Temperature sensor. 
                                                            
//------------------------------------------------------------------------------
// CCH0CN Enums (Cache Control @ 0xA1)
//------------------------------------------------------------------------------
#define CCH0CN_CHBLKW__BMASK                0x01 ///< Block Write Enable                                
#define CCH0CN_CHBLKW__SHIFT                0x00 ///< Block Write Enable                                
#define CCH0CN_CHBLKW__BLOCK_WRITE_DISABLED 0x00 ///< Each byte of a firmware flash write is written    
                                                 ///< individually.                                     
#define CCH0CN_CHBLKW__BLOCK_WRITE_ENABLED  0x01 ///< Flash bytes are written in groups of four.        
                                                                                                        
#define CCH0CN_CHMOVC__BMASK                0x02 ///< Cache MOVC Enable                                 
#define CCH0CN_CHMOVC__SHIFT                0x01 ///< Cache MOVC Enable                                 
#define CCH0CN_CHMOVC__DISABLED             0x00 ///< Data requested by MOVC instructions will not be   
                                                 ///< cached.                                           
#define CCH0CN_CHMOVC__ENABLED              0x02 ///< Data requested by MOVC instructions will be loaded
                                                 ///< into cache memory.                                
                                                                                                        
#define CCH0CN_CHISR__BMASK                 0x04 ///< Cache ISR Enable                                  
#define CCH0CN_CHISR__SHIFT                 0x02 ///< Cache ISR Enable                                  
#define CCH0CN_CHISR__DISABLED              0x00 ///< Instructions in ISRs will not be loaded into cache
                                                 ///< memory.                                           
#define CCH0CN_CHISR__ENABLED               0x04 ///< Instructions in ISRs can be cached.               
                                                                                                        
#define CCH0CN_CHRETI__BMASK                0x08 ///< Cache RETI Destination Enable                     
#define CCH0CN_CHRETI__SHIFT                0x03 ///< Cache RETI Destination Enable                     
#define CCH0CN_CHRETI__DISABLED             0x00 ///< Destinations of RETI instructions will not be     
                                                 ///< cached.                                           
#define CCH0CN_CHRETI__ENABLED              0x08 ///< RETI destinations will be cached.                 
                                                                                                        
#define CCH0CN_CHFLSH__BMASK                0x10 ///< Cache Flush                                       
#define CCH0CN_CHFLSH__SHIFT                0x04 ///< Cache Flush                                       
#define CCH0CN_CHFLSH__DO_NOT_FLUSH         0x00 ///< Do not flush the cache.                           
#define CCH0CN_CHFLSH__FLUSH                0x10 ///< Flush the cache.                                  
                                                                                                        
#define CCH0CN_CHPFEN__BMASK                0x20 ///< Cache Prefetch Enable                             
#define CCH0CN_CHPFEN__SHIFT                0x05 ///< Cache Prefetch Enable                             
#define CCH0CN_CHPFEN__PREFETCH_DISABLED    0x00 ///< Disable the prefetch engine.                      
#define CCH0CN_CHPFEN__PREFETCH_ENABLED     0x20 ///< Enable the prefetch engine.                       
                                                                                                        
#define CCH0CN_CHRDEN__BMASK                0x40 ///< Cache Read Enable                                 
#define CCH0CN_CHRDEN__SHIFT                0x06 ///< Cache Read Enable                                 
#define CCH0CN_CHRDEN__READ_DISABLED        0x00 ///< All instruction data comes from Flash memory or   
                                                 ///< the prefetch engine.                              
#define CCH0CN_CHRDEN__READ_ENABLED         0x40 ///< Instruction data is obtained from cache (when     
                                                 ///< available).                                       
                                                                                                        
#define CCH0CN_CHWREN__BMASK                0x80 ///< Cache Write Enable                                
#define CCH0CN_CHWREN__SHIFT                0x07 ///< Cache Write Enable                                
#define CCH0CN_CHWREN__WRITE_DISABLED       0x00 ///< Cache contents are not allowed to change, except  
                                                 ///< during flash writes/erasures or cache locks.      
#define CCH0CN_CHWREN__WRITE_ENABLED        0x80 ///< Writes to cache memory are allowed.               
                                                                                                        
//------------------------------------------------------------------------------
// CCH0LC Enums (Cache Lock Control @ 0xA3)
//------------------------------------------------------------------------------
#define CCH0LC_CHSLOT__FMASK    0x3F ///< Cache Slot Pointer                               
#define CCH0LC_CHSLOT__SHIFT    0x00 ///< Cache Slot Pointer                               
                                                                                           
#define CCH0LC_CHPOP__BMASK     0x40 ///< Cache Pop                                        
#define CCH0LC_CHPOP__SHIFT     0x06 ///< Cache Pop                                        
#define CCH0LC_CHPOP__NOT_SET   0x00 ///< Do not increment CHSLOT.                         
#define CCH0LC_CHPOP__SET       0x40 ///< Increment CHSLOT and unlock that location.       
                                                                                           
#define CCH0LC_CHPUSH__BMASK    0x80 ///< Cache Push Enable                                
#define CCH0LC_CHPUSH__SHIFT    0x07 ///< Cache Push Enable                                
#define CCH0LC_CHPUSH__DISABLED 0x00 ///< Disable cache push operations.                   
#define CCH0LC_CHPUSH__ENABLED  0x80 ///< Enable cache push operations. When a MOVC read is
                                     ///< executed, the requested 4-byte segment containing
                                     ///< the data is locked into the cache at the location
                                     ///< indicated by CHSLOT, and CHSLOT is decremented.  
                                                                                           
//------------------------------------------------------------------------------
// CCH0MA Enums (Cache Miss Accumulator @ 0x9A)
//------------------------------------------------------------------------------
#define CCH0MA_CHMSCTH__FMASK      0x7F ///< Cache Miss Penalty Accumulator               
#define CCH0MA_CHMSCTH__SHIFT      0x00 ///< Cache Miss Penalty Accumulator               
                                                                                          
