ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define CCH0MA_CHMSOV__BMASK       0x80 ///< Cache Miss Penalty Overflow                  
#define CCH0MA_CHMSOV__SHIFT       0x07 ///< Cache Miss Penalty Overflow                  
#define CCH0MA_CHMSOV__NO_OVERFLOW 0x00 ///< The cache miss penalty accumulator has not   
                                        ///< overflowed since it was last written.        
#define CCH0MA_CHMSOV__OVERFLOW    0x80 ///< The cache miss penalty accumulator overflowed
                                        ///< since it was last written.                   
                                                                                          
//------------------------------------------------------------------------------
// CCH0TN Enums (Cache Tuning @ 0xA2)
//------------------------------------------------------------------------------
#define CCH0TN_CHMSTH__FMASK         0x03 ///< Cache Miss Penalty Threshold                      
#define CCH0TN_CHMSTH__SHIFT         0x00 ///< Cache Miss Penalty Threshold                      
#define CCH0TN_CHMSTH__0_CLOCKS      0x00 ///< Data that takes longer than 0 clocks to obtain    
                                          ///< will be cached.                                   
#define CCH0TN_CHMSTH__1_CLOCK       0x01 ///< Data that takes longer than 1 clock to obtain will
                                          ///< be cached.                                        
#define CCH0TN_CHMSTH__2_CLOCKS      0x02 ///< Data that takes longer than 2 clocks to obtain    
                                          ///< will be cached.                                   
#define CCH0TN_CHMSTH__3_CLOCKS      0x03 ///< Data that takes longer than 3 clocks to obtain    
                                          ///< will be cached.                                   
                                                                                                 
#define CCH0TN_CHFIXM__BMASK         0x04 ///< Cache Fix MOVC Enable                             
#define CCH0TN_CHFIXM__SHIFT         0x02 ///< Cache Fix MOVC Enable                             
#define CCH0TN_CHFIXM__USE_ALGORITHM 0x00 ///< MOVC data is written according to the current     
                                          ///< algorithm selected by the CHALGM bit.             
#define CCH0TN_CHFIXM__ALWAYS_SLOT_0 0x04 ///< MOVC data is always written to cache slot 0.      
                                                                                                 
#define CCH0TN_CHALGM__BMASK         0x08 ///< Cache Algorithm Select                            
#define CCH0TN_CHALGM__SHIFT         0x03 ///< Cache Algorithm Select                            
#define CCH0TN_CHALGM__REBOUND       0x00 ///< Cache uses Rebound algorithm.                     
#define CCH0TN_CHALGM__PSEUDO_RANDOM 0x08 ///< Cache uses Pseudo-random algorithm.               
                                                                                                 
#define CCH0TN_CHMSCTL__FMASK        0xF0 ///< Cache Miss Penalty Accumulator                    
#define CCH0TN_CHMSCTL__SHIFT        0x04 ///< Cache Miss Penalty Accumulator                    
                                                                                                 
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSBANK Enums (Program Space Bank Select @ 0xB1)
//------------------------------------------------------------------------------
#define PSBANK_IFBANK__FMASK 0x03 ///< Instruction Fetch Operations Bank Select         
#define PSBANK_IFBANK__SHIFT 0x00 ///< Instruction Fetch Operations Bank Select         
#define PSBANK_IFBANK__BANK0 0x00 ///< Instructions fetch from Bank 0 (note that Bank 0 
                                  ///< is also mapped between 0x0000 to 0x7FFF).        
#define PSBANK_IFBANK__BANK1 0x01 ///< Instructions fetch from Bank 1.                  
#define PSBANK_IFBANK__BANK2 0x02 ///< Instructions fetch from Bank 2.                  
#define PSBANK_IFBANK__BANK3 0x03 ///< Instructions fetch from Bank 3.                  
                                                                                        
#define PSBANK_COBANK__FMASK 0x30 ///< Constant Operations Bank Select                  
#define PSBANK_COBANK__SHIFT 0x04 ///< Constant Operations Bank Select                  
#define PSBANK_COBANK__BANK0 0x00 ///< Constant operations target Bank 0 (note that Bank
                                  ///< 0 is also mapped between 0x0000 to 0x7FFF).      
#define PSBANK_COBANK__BANK1 0x10 ///< Constant operations target Bank 1.               
#define PSBANK_COBANK__BANK2 0x20 ///< Constant operations target Bank 2.               
#define PSBANK_COBANK__BANK3 0x30 ///< Constant operations target Bank 2.               
                                                                                        
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
