ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define CPT1CN_CPOUT__BMASK                0x40 ///< Comparator Output State Flag                      
#define CPT1CN_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag                      
#define CPT1CN_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP1P < CP1N.                           
#define CPT1CN_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP1P > CP1N.                           
                                                                                                       
#define CPT1CN_CPEN__BMASK                 0x80 ///< Comparator Enable                                 
#define CPT1CN_CPEN__SHIFT                 0x07 ///< Comparator Enable                                 
#define CPT1CN_CPEN__DISABLED              0x00 ///< Comparator disabled.                              
#define CPT1CN_CPEN__ENABLED               0x80 ///< Comparator enabled.                               
                                                                                                       
//------------------------------------------------------------------------------
// CPT1MD Enums (Comparator 1 Mode @ 0x89)
//------------------------------------------------------------------------------
#define CPT1MD_CPMD__FMASK              0x03 ///< Comparator Mode Select                      
#define CPT1MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select                      
#define CPT1MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption)                                
#define CPT1MD_CPMD__MODE1              0x01 ///< Mode 1                                      
#define CPT1MD_CPMD__MODE2              0x02 ///< Mode 2                                      
#define CPT1MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power 
                                             ///< Consumption)                                
                                                                                              
#define CPT1MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT1MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT1MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled. 
#define CPT1MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.  
                                                                                              
#define CPT1MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT1MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT1MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.  
#define CPT1MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.   
                                                                                              
//------------------------------------------------------------------------------
// DAC0CN Enums (DAC0 Control @ 0xD4)
//------------------------------------------------------------------------------
#define DAC0CN_DAC0DF__FMASK           0x07 ///< DAC0 Data Format                                  
#define DAC0CN_DAC0DF__SHIFT           0x00 ///< DAC0 Data Format                                  
#define DAC0CN_DAC0DF__RIGHT_JUSTIFIED 0x00 ///< Right justified. The most significant nibble of   
                                            ///< the DAC0 Data Word is in DAC0H[3:0], while the    
                                            ///< least significant byte is in DAC0L.               
#define DAC0CN_DAC0DF__RIGHT_SHIFT_1   0x01 ///< Right justified. Shifted left by 1 bit. The most  
                                            ///< significant 5 bits of the DAC0 Data Word is in    
                                            ///< DAC0H[4:0], while the least significant 7 bits are
                                            ///< in DAC0L[7:1].                                    
#define DAC0CN_DAC0DF__RIGHT_SHIFT_2   0x02 ///< Right justified. Shifted left by 2 bits. The most 
                                            ///< significant 6 bits of the DAC0 Data Word is in    
                                            ///< DAC0H[5:0], while the least significant 6 bits are
                                            ///< in DAC0L[7:2].                                    
#define DAC0CN_DAC0DF__RIGHT_SHIFT_3   0x03 ///< Right justified. Shifted left by 3 bits. The most 
                                            ///< significant 7 bits of the DAC0 Data Word is in    
                                            ///< DAC0H[6:0], while the least significant 5 bits are
                                            ///< in DAC0L[7:3].                                    
#define DAC0CN_DAC0DF__LEFT_NO_SHIFT   0x04 ///< Left justified. The most significant 8-bits of the
                                            ///< DAC0 Data Word is in DAC0H[7:0], while the least  
                                            ///< significant 4-bits are in DAC0L[7:4].             
                                                                                                   
#define DAC0CN_DAC0MD__FMASK           0x18 ///< DAC0 Mode                                         
#define DAC0CN_DAC0MD__SHIFT           0x03 ///< DAC0 Mode                                         
#define DAC0CN_DAC0MD__DAC0H           0x00 ///< DAC output updates occur on a write to DAC0H.     
#define DAC0CN_DAC0MD__TIMER3          0x08 ///< DAC output updates occur on a Timer 3 overflow.   
#define DAC0CN_DAC0MD__TIMER4          0x10 ///< DAC output updates occur on a Timer 4 overflow.   
#define DAC0CN_DAC0MD__TIMER2          0x18 ///< DAC output updates occur on a Timer 2 overflow.   
                                                                                                   
#define DAC0CN_DAC0EN__BMASK           0x80 ///< DAC0 Enable                                       
#define DAC0CN_DAC0EN__SHIFT           0x07 ///< DAC0 Enable                                       
#define DAC0CN_DAC0EN__DISABLED        0x00 ///< DAC0 disabled. DAC0 output pin is disabled; DAC0  
                                            ///< is in low-power shutdown mode.                    
#define DAC0CN_DAC0EN__ENABLED         0x80 ///< DAC0 enabled. DAC0 output pin is active; DAC0 is  
                                            ///< operational.                                      
                                                                                                   
//------------------------------------------------------------------------------
// DAC0H Enums (DAC0 Data High Byte @ 0xD3)
//------------------------------------------------------------------------------
#define DAC0H_DAC0H__FMASK 0xFF ///< DAC0 Data High
#define DAC0H_DAC0H__SHIFT 0x00 ///< DAC0 Data High
                                                   
//------------------------------------------------------------------------------
// DAC0L Enums (DAC0 Data Low Byte @ 0xD2)
//------------------------------------------------------------------------------
#define DAC0L_DAC0L__FMASK 0xFF ///< DAC0 Data Low
#define DAC0L_DAC0L__SHIFT 0x00 ///< DAC0 Data Low
                                                  
//------------------------------------------------------------------------------
// DAC1CN Enums (DAC1 Control @ 0xD4)
//------------------------------------------------------------------------------
#define DAC1CN_DAC1DF__FMASK           0x07 ///< DAC1 Data Format                                  
#define DAC1CN_DAC1DF__SHIFT           0x00 ///< DAC1 Data Format                                  
#define DAC1CN_DAC1DF__RIGHT_JUSTIFIED 0x00 ///< Right justified. The most significant nibble of   
                                            ///< the DAC1 Data Word is in DAC1H[3:0], while the    
                                            ///< least significant byte is in DAC1L.               
#define DAC1CN_DAC1DF__RIGHT_SHIFT_1   0x01 ///< Right justified. Shifted left by 1 bit. The most  
                                            ///< significant 5 bits of the DAC1 Data Word is in    
                                            ///< DAC1H[4:0], while the least significant 7 bits are
                                            ///< in DAC1L[7:1].                                    
#define DAC1CN_DAC1DF__RIGHT_SHIFT_2   0x02 ///< Right justified. Shifted left by 2 bits. The most 
                                            ///< significant 6 bits of the DAC1 Data Word is in    
                                            ///< DAC1H[5:0], while the least significant 6 bits are
                                            ///< in DAC1L[7:2].                                    
#define DAC1CN_DAC1DF__RIGHT_SHIFT_3   0x03 ///< Right justified. Shifted left by 3 bits. The most 
                                            ///< significant 7 bits of the DAC1 Data Word is in    
                                            ///< DAC1H[6:0], while the least significant 5 bits are
                                            ///< in DAC1L[7:3].                                    
#define DAC1CN_DAC1DF__LEFT_NO_SHIFT   0x04 ///< Left justified. The most significant 8-bits of the
                                            ///< DAC1 Data Word is in DAC1H[7:0], while the least  
                                            ///< significant 4-bits are in DAC1L[7:4].             
                                                                                                   
