ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define DAC1CN_DAC1MD__FMASK           0x18 ///< DAC1 Mode                                         
#define DAC1CN_DAC1MD__SHIFT           0x03 ///< DAC1 Mode                                         
#define DAC1CN_DAC1MD__DAC1H           0x00 ///< DAC output updates occur on a write to DAC1H.     
#define DAC1CN_DAC1MD__TIMER3          0x08 ///< DAC output updates occur on a Timer 3 overflow.   
#define DAC1CN_DAC1MD__TIMER4          0x10 ///< DAC output updates occur on a Timer 4 overflow.   
#define DAC1CN_DAC1MD__TIMER2          0x18 ///< DAC output updates occur on a Timer 2 overflow.   
                                                                                                   
#define DAC1CN_DAC1EN__BMASK           0x80 ///< DAC1 Enable                                       
#define DAC1CN_DAC1EN__SHIFT           0x07 ///< DAC1 Enable                                       
#define DAC1CN_DAC1EN__DISABLED        0x00 ///< DAC1 disabled. DAC1 output pin is disabled; DAC1  
                                            ///< is in low-power shutdown mode.                    
#define DAC1CN_DAC1EN__ENABLED         0x80 ///< DAC1 enabled. DAC1 output pin is active; DAC1 is  
                                            ///< operational.                                      
                                                                                                   
//------------------------------------------------------------------------------
// DAC1H Enums (DAC1 Data High Byte @ 0xD3)
//------------------------------------------------------------------------------
#define DAC1H_DAC1H__FMASK 0xFF ///< DAC1 Data High
#define DAC1H_DAC1H__SHIFT 0x00 ///< DAC1 Data High
                                                   
//------------------------------------------------------------------------------
// DAC1L Enums (DAC1 Data Low Byte @ 0xD2)
//------------------------------------------------------------------------------
#define DAC1L_DAC1L__FMASK 0xFF ///< DAC1 Data Low
#define DAC1L_DAC1L__SHIFT 0x00 ///< DAC1 Data Low
                                                  
//------------------------------------------------------------------------------
// OSCXCN Enums (External Oscillator Control @ 0x8C)
//------------------------------------------------------------------------------
#define OSCXCN_XFCN__FMASK           0x07 ///< External Oscillator Frequency Control             
#define OSCXCN_XFCN__SHIFT           0x00 ///< External Oscillator Frequency Control             
#define OSCXCN_XFCN__MODE0           0x00 ///< Select external oscillator mode 0: Crystal        
                                          ///< frequency <= 32 kHz, RC/C frequency <= 25 kHz, C  
                                          ///< mode K factor = 0.87.                             
#define OSCXCN_XFCN__MODE1           0x01 ///< Select external oscillator mode 1: 32 kHz <       
                                          ///< Crystal frequency <= 84 kHz, 25 kHz < RC/C        
                                          ///< frequency <= 50 kHz, C mode K factor = 2.6.       
#define OSCXCN_XFCN__MODE2           0x02 ///< Select external oscillator mode 2: 84 kHz <       
                                          ///< Crystal frequency <= 225 kHz, 50 kHz < RC/C       
                                          ///< frequency <= 100 kHz, C mode K factor = 7.7.      
#define OSCXCN_XFCN__MODE3           0x03 ///< Select external oscillator mode 3: 225 kHz <      
                                          ///< Crystal frequency <= 590 kHz, 100 kHz < RC/C      
                                          ///< frequency <= 200 kHz, C mode K factor = 22.       
#define OSCXCN_XFCN__MODE4           0x04 ///< Select external oscillator mode 4: 590 kHz <      
                                          ///< Crystal frequency <= 1.5 MHz, 200 kHz < RC/C      
                                          ///< frequency <= 400 kHz, C mode K factor = 65.       
#define OSCXCN_XFCN__MODE5           0x05 ///< Select external oscillator mode 5: 1.5 MHz <      
                                          ///< Crystal frequency <= 4 MHz, 400 kHz < RC/C        
                                          ///< frequency <= 800 kHz, C mode K factor = 180.      
#define OSCXCN_XFCN__MODE6           0x06 ///< Select external oscillator mode 6: 4 MHz < Crystal
                                          ///< frequency <= 10 MHz, 800 kHz < RC/C frequency <=  
                                          ///< 1.6 MHz, C mode K factor = 664.                   
#define OSCXCN_XFCN__MODE7           0x07 ///< Select external oscillator mode 7: 10 MHz <       
                                          ///< Crystal frequency <= 30 MHz, 1.6 MHz < RC/C       
                                          ///< frequency <= 3.2 MHz, C mode K factor = 1590.     
                                                                                                 
#define OSCXCN_XOSCMD__FMASK         0x70 ///< External Oscillator Mode                          
#define OSCXCN_XOSCMD__SHIFT         0x04 ///< External Oscillator Mode                          
#define OSCXCN_XOSCMD__DISABLED      0x00 ///< External Oscillator circuit disabled.             
#define OSCXCN_XOSCMD__CMOS          0x20 ///< External CMOS Clock Mode.                         
#define OSCXCN_XOSCMD__CMOS_DIV_2    0x30 ///< External CMOS Clock Mode with divide by 2 stage.  
#define OSCXCN_XOSCMD__RC            0x40 ///< RC Oscillator Mode with divide by 2 stage.        
#define OSCXCN_XOSCMD__CRYSTAL       0x60 ///< Crystal Oscillator Mode.                          
#define OSCXCN_XOSCMD__CRYSTAL_DIV_2 0x70 ///< Crystal Oscillator Mode with divide by 2 stage.   
                                                                                                 
#define OSCXCN_XTLVLD__BMASK         0x80 ///< Crystal Oscillator Valid Flag                     
#define OSCXCN_XTLVLD__SHIFT         0x07 ///< Crystal Oscillator Valid Flag                     
#define OSCXCN_XTLVLD__NOT_SET       0x00 ///< External crystal is unused or not yet stable.     
#define OSCXCN_XTLVLD__SET           0x80 ///< External crystal is running and stable.           
                                                                                                 
//------------------------------------------------------------------------------
// FLACL Enums (Flash Access Limit @ 0xB7)
//------------------------------------------------------------------------------
#define FLACL_FLACL__FMASK 0xFF ///< Flash Access Limit
#define FLACL_FLACL__SHIFT 0x00 ///< Flash Access Limit
                                                       
//------------------------------------------------------------------------------
// FLSCL Enums (Flash Scale @ 0xB7)
//------------------------------------------------------------------------------
#define FLSCL_FLWE__BMASK                0x01 ///< Flash Write/Erase Enable     
#define FLSCL_FLWE__SHIFT                0x00 ///< Flash Write/Erase Enable     
#define FLSCL_FLWE__DISABLED             0x00 ///< Flash writes/erases disabled.
#define FLSCL_FLWE__ENABLED              0x01 ///< Flash writes/erases enabled. 
                                                                                
