ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define FLSCL_FLRT__FMASK                0x30 ///< Flash Read Timing            
#define FLSCL_FLRT__SHIFT                0x04 ///< Flash Read Timing            
#define FLSCL_FLRT__SYSCLK_BELOW_25_MHZ  0x00 ///< SYSCLK <= 25 MHz.            
#define FLSCL_FLRT__SYSCLK_BELOW_50_MHZ  0x10 ///< SYSCLK <= 50 MHz.            
#define FLSCL_FLRT__SYSCLK_BELOW_75_MHZ  0x20 ///< SYSCLK <= 75 MHz.            
#define FLSCL_FLRT__SYSCLK_BELOW_100_MHZ 0x30 ///< SYSCLK <= 100 MHz.           
                                                                                
//------------------------------------------------------------------------------
// FLSTAT Enums (Flash Status @ 0x88)
//------------------------------------------------------------------------------
#define FLSTAT_FLBUSY__BMASK   0x01 ///< Flash Busy                                 
#define FLSTAT_FLBUSY__SHIFT   0x00 ///< Flash Busy                                 
#define FLSTAT_FLBUSY__NOT_SET 0x00 ///< Flash is idle or reading.                  
#define FLSTAT_FLBUSY__SET     0x01 ///< Flash write/erase operation is currently in
                                    ///< progress.                                  
                                                                                    
//------------------------------------------------------------------------------
// PSCTL Enums (Program Store Control @ 0x8F)
//------------------------------------------------------------------------------
#define PSCTL_PSWE__BMASK               0x01 ///< Program Store Write Enable                      
#define PSCTL_PSWE__SHIFT               0x00 ///< Program Store Write Enable                      
#define PSCTL_PSWE__WRITE_DISABLED      0x00 ///< Writes to flash program memory disabled.        
#define PSCTL_PSWE__WRITE_ENABLED       0x01 ///< Writes to flash program memory enabled; the MOVX
                                             ///< write instruction targets flash memory.         
                                                                                                  
#define PSCTL_PSEE__BMASK               0x02 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__SHIFT               0x01 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__ERASE_DISABLED      0x00 ///< Flash program memory erasure disabled.          
#define PSCTL_PSEE__ERASE_ENABLED       0x02 ///< Flash program memory erasure enabled.           
                                                                                                  
#define PSCTL_SFLE__BMASK               0x04 ///< Scratchpad Flash Memory Access Enable           
#define PSCTL_SFLE__SHIFT               0x02 ///< Scratchpad Flash Memory Access Enable           
#define PSCTL_SFLE__SCRATCHPAD_DISABLED 0x00 ///< Flash access from user software directed to the 
                                             ///< Program/Data flash sector.                      
#define PSCTL_SFLE__SCRATCHPAD_ENABLED  0x04 ///< Flash access from user software directed to the 
                                             ///< two 128 byte Scratchpad sectors.                
                                                                                                  
//------------------------------------------------------------------------------
// OSCICL Enums (High Frequency Oscillator Calibration @ 0x8B)
//------------------------------------------------------------------------------
#define OSCICL_OSCICL__FMASK 0xFF ///< Internal Oscillator Calibration
#define OSCICL_OSCICL__SHIFT 0x00 ///< Internal Oscillator Calibration
                                                                      
//------------------------------------------------------------------------------
// OSCICN Enums (High Frequency Oscillator Control @ 0x8A)
//------------------------------------------------------------------------------
#define OSCICN_IFCN__FMASK       0x03 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__SHIFT       0x00 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__HFOSC_DIV_8 0x00 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 8.                                    
#define OSCICN_IFCN__HFOSC_DIV_4 0x01 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 4.                                    
#define OSCICN_IFCN__HFOSC_DIV_2 0x02 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 2.                                    
#define OSCICN_IFCN__HFOSC_DIV_1 0x03 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 1.                                    
                                                                                            
#define OSCICN_IFRDY__BMASK      0x40 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__SHIFT      0x06 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__NOT_SET    0x00 ///< The Internal High Frequency Oscillator is not    
                                      ///< running at the programmed frequency.             
#define OSCICN_IFRDY__SET        0x40 ///< The Internal High Frequency Oscillator is running
                                      ///< at the programmed frequency.                     
                                                                                            
#define OSCICN_IOSCEN__BMASK     0x80 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__SHIFT     0x07 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__DISABLED  0x00 ///< Disable the High Frequency Oscillator.           
#define OSCICN_IOSCEN__ENABLED   0x80 ///< Enable the High Frequency Oscillator.            
                                                                                            
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESPI0__BMASK     0x01 ///< SPI0 Interrupt Enable                             
#define EIE1_ESPI0__SHIFT     0x00 ///< SPI0 Interrupt Enable                             
#define EIE1_ESPI0__DISABLED  0x00 ///< Disable all SPI0 interrupts.                      
#define EIE1_ESPI0__ENABLED   0x01 ///< Enable interrupt requests generated by SPI0.      
                                                                                          
#define EIE1_EMAT__BMASK      0x02 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__SHIFT      0x01 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__DISABLED   0x00 ///< Disable all Port Match interrupts.                
#define EIE1_EMAT__ENABLED    0x02 ///< Enable interrupt requests generated by a Port     
                                   ///< Match.                                            
                                                                                          
