ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define EIE1_ESMB0__BMASK     0x02 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__SHIFT     0x01 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__DISABLED  0x00 ///< Disable all SMB0 interrupts.                      
#define EIE1_ESMB0__ENABLED   0x02 ///< Enable interrupt requests generated by SMB0.      
                                                                                          
#define EIE1_EWADC0__BMASK    0x04 ///< ADC0 Window Comparison Interrupt Enable           
#define EIE1_EWADC0__SHIFT    0x02 ///< ADC0 Window Comparison Interrupt Enable           
#define EIE1_EWADC0__DISABLED 0x00 ///< Disable ADC0 Window Comparison interrupt.         
#define EIE1_EWADC0__ENABLED  0x04 ///< Enable interrupt requests generated by ADC0 Window
                                   ///< Compare flag (ADWINT).                            
                                                                                          
#define EIE1_EADC0__BMASK     0x08 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__SHIFT     0x03 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__DISABLED  0x00 ///< Disable ADC0 Conversion Complete interrupt.       
#define EIE1_EADC0__ENABLED   0x08 ///< Enable interrupt requests generated by the ADINT  
                                   ///< flag.                                             
                                                                                          
#define EIE1_EPCA0__BMASK     0x08 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__SHIFT     0x03 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__DISABLED  0x00 ///< Disable all PCA0 interrupts.                      
#define EIE1_EPCA0__ENABLED   0x08 ///< Enable interrupt requests generated by PCA0.      
                                                                                          
#define EIE1_ECP0F__BMASK     0x10 ///< Comparator0 (CP0) Falling Edge Interrupt Enable   
#define EIE1_ECP0F__SHIFT     0x04 ///< Comparator0 (CP0) Falling Edge Interrupt Enable   
#define EIE1_ECP0F__DISABLED  0x00 ///< Disable CP0 falling edge interrupts.              
#define EIE1_ECP0F__ENABLED   0x10 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPFIF flag.                          
                                                                                          
#define EIE1_ECP0__BMASK      0x20 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__SHIFT      0x05 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__DISABLED   0x00 ///< Disable CP0 interrupts.                           
#define EIE1_ECP0__ENABLED    0x20 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPRIF or CPFIF flags.                
                                                                                          
#define EIE1_ECP0R__BMASK     0x20 ///< Comparator0 (CP0) Rising Edge Interrupt Enable    
#define EIE1_ECP0R__SHIFT     0x05 ///< Comparator0 (CP0) Rising Edge Interrupt Enable    
#define EIE1_ECP0R__DISABLED  0x00 ///< Disable CP0 rising edge interrupts.               
#define EIE1_ECP0R__ENABLED   0x20 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPRIF flag.                          
                                                                                          
#define EIE1_ECP1__BMASK      0x40 ///< Comparator1 (CP1) Interrupt Enable                
#define EIE1_ECP1__SHIFT      0x06 ///< Comparator1 (CP1) Interrupt Enable                
#define EIE1_ECP1__DISABLED   0x00 ///< Disable CP1 interrupts.                           
#define EIE1_ECP1__ENABLED    0x40 ///< Enable interrupt requests generated by the        
                                   ///< comparator 1 CPRIF or CPFIF flags.                
                                                                                          
#define EIE1_ECP1F__FMASK     0xC0 ///< Comparator1 (CP1) Falling Edge Interrupt Enable   
#define EIE1_ECP1F__SHIFT     0x06 ///< Comparator1 (CP1) Falling Edge Interrupt Enable   
#define EIE1_ECP1F__DISABLED  0x00 ///< Disable CP1 rising edge interrupts.               
#define EIE1_ECP1F__ENABLED   0x40 ///< Enable interrupt requests generated by the        
                                   ///< comparator 1 CPRIF flag.                          
                                                                                          
#define EIE1_ET3__BMASK       0x80 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__SHIFT       0x07 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__DISABLED    0x00 ///< Disable Timer 3 interrupts.                       
#define EIE1_ET3__ENABLED     0x80 ///< Enable interrupt requests generated by the TF3L or
                                   ///< TF3H flags.                                       
                                                                                          
//------------------------------------------------------------------------------
// EIE2 Enums (Extended Interrupt Enable 2 @ 0xE7)
//------------------------------------------------------------------------------
#define EIE2_ET3__BMASK       0x01 ///< Timer 3 Interrupt Enable                          
#define EIE2_ET3__SHIFT       0x00 ///< Timer 3 Interrupt Enable                          
#define EIE2_ET3__DISABLED    0x00 ///< Disable Timer 3 interrupts.                       
#define EIE2_ET3__ENABLED     0x01 ///< Enable interrupt requests generated by the TF3L or
                                   ///< TF3H flags.                                       
                                                                                          
#define EIE2_EADC0__BMASK     0x02 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE2_EADC0__SHIFT     0x01 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE2_EADC0__DISABLED  0x00 ///< Disable ADC0 Conversion Complete interrupt.       
#define EIE2_EADC0__ENABLED   0x02 ///< Enable interrupt requests generated by the ADINT  
                                   ///< flag.                                             
                                                                                          
