ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define EIE2_ET4__BMASK       0x04 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__SHIFT       0x02 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__DISABLED    0x00 ///< Disable Timer 4 interrupts.                       
#define EIE2_ET4__ENABLED     0x04 ///< Enable interrupt requests generated by the TF4L or
                                   ///< TF4H flags.                                       
                                                                                          
#define EIE2_EWADC2__BMASK    0x08 ///< ADC2 Window Comparison Interrupt Enable           
#define EIE2_EWADC2__SHIFT    0x03 ///< ADC2 Window Comparison Interrupt Enable           
#define EIE2_EWADC2__DISABLED 0x00 ///< Disable ADC2 Window Comparison interrupt.         
#define EIE2_EWADC2__ENABLED  0x08 ///< Enable interrupt requests generated by ADC2 Window
                                   ///< Compare flag (ADWINT).                            
                                                                                          
#define EIE2_EADC2__BMASK     0x10 ///< ADC2 Conversion Complete Interrupt Enable         
#define EIE2_EADC2__SHIFT     0x04 ///< ADC2 Conversion Complete Interrupt Enable         
#define EIE2_EADC2__DISABLED  0x00 ///< Disable ADC2 Conversion Complete interrupt.       
#define EIE2_EADC2__ENABLED   0x10 ///< Enable interrupt requests generated by the ADINT  
                                   ///< flag.                                             
                                                                                          
#define EIE2_ES1__BMASK       0x40 ///< UART1 Interrupt Enable                            
#define EIE2_ES1__SHIFT       0x06 ///< UART1 Interrupt Enable                            
#define EIE2_ES1__DISABLED    0x00 ///< Disable UART1 interrupts.                         
#define EIE2_ES1__ENABLED     0x40 ///< Enable UART1 interrupts.                          
                                                                                          
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 Low @ 0xF6)
//------------------------------------------------------------------------------
#define EIP1_PSPI0__BMASK  0x01 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define EIP1_PSPI0__SHIFT  0x00 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define EIP1_PSPI0__LOW    0x00 ///< SPI0 interrupt priority set to low.                          
#define EIP1_PSPI0__HIGH   0x01 ///< SPI0 interrupt priority set to high.                         
                                                                                                  
#define EIP1_PMAT__BMASK   0x02 ///< Port Match Interrupt Priority Control                        
#define EIP1_PMAT__SHIFT   0x01 ///< Port Match Interrupt Priority Control                        
#define EIP1_PMAT__LOW     0x00 ///< Port Match interrupt set to low priority level.              
#define EIP1_PMAT__HIGH    0x02 ///< Port Match interrupt set to high priority level.             
                                                                                                  
#define EIP1_PSMB0__BMASK  0x02 ///< SMBus (SMB0) Interrupt Priority Control                      
#define EIP1_PSMB0__SHIFT  0x01 ///< SMBus (SMB0) Interrupt Priority Control                      
#define EIP1_PSMB0__LOW    0x00 ///< SMB0 interrupt priority set to low.                          
#define EIP1_PSMB0__HIGH   0x02 ///< SMB0 interrupt priority set to high.                         
                                                                                                  
#define EIP1_PWADC0__BMASK 0x04 ///< ADC0 Window Comparator Interrupt Priority Control            
#define EIP1_PWADC0__SHIFT 0x02 ///< ADC0 Window Comparator Interrupt Priority Control            
#define EIP1_PWADC0__LOW   0x00 ///< ADC0 Conversion Complete interrupt priority set to           
                                ///< low.                                                         
#define EIP1_PWADC0__HIGH  0x04 ///< ADC0 Conversion Complete interrupt priority set to           
                                ///< high.                                                        
                                                                                                  
#define EIP1_PADC0__BMASK  0x08 ///< ADC0 Conversion Complete Interrupt Priority Control          
#define EIP1_PADC0__SHIFT  0x03 ///< ADC0 Conversion Complete Interrupt Priority Control          
#define EIP1_PADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt set to low                
                                ///< priority level.                                              
#define EIP1_PADC0__HIGH   0x08 ///< ADC0 Conversion Complete interrupt set to high               
                                ///< priority level.                                              
                                                                                                  
#define EIP1_PPCA0__BMASK  0x08 ///< Programmable Counter Array (PCA0) Interrupt Priority Control 
#define EIP1_PPCA0__SHIFT  0x03 ///< Programmable Counter Array (PCA0) Interrupt Priority Control 
#define EIP1_PPCA0__LOW    0x00 ///< PCA0 interrupt priority set to low.                          
#define EIP1_PPCA0__HIGH   0x08 ///< PCA0 interrupt priority set to high.                         
                                                                                                  
#define EIP1_PCP0F__BMASK  0x10 ///< Comparator0 (CP0) Falling Edge Interrupt Priority Control    
#define EIP1_PCP0F__SHIFT  0x04 ///< Comparator0 (CP0) Falling Edge Interrupt Priority Control    
#define EIP1_PCP0F__LOW    0x00 ///< CP0 falling edge interrupt priority set to low.              
#define EIP1_PCP0F__HIGH   0x10 ///< CP0 falling edge interrupt priority set to high.             
                                                                                                  
#define EIP1_PCP0__BMASK   0x20 ///< Comparator0 (CP0) Interrupt Priority Control                 
#define EIP1_PCP0__SHIFT   0x05 ///< Comparator0 (CP0) Interrupt Priority Control                 
#define EIP1_PCP0__LOW     0x00 ///< CP0 interrupt set to low priority level.                     
#define EIP1_PCP0__HIGH    0x20 ///< CP0 interrupt set to high priority level.                    
                                                                                                  
#define EIP1_PCP0R__BMASK  0x20 ///< Comparator0 (CP0) Rising Edge Interrupt Priority Control     
#define EIP1_PCP0R__SHIFT  0x05 ///< Comparator0 (CP0) Rising Edge Interrupt Priority Control     
#define EIP1_PCP0R__LOW    0x00 ///< CP0 rising edge interrupt priority set to low.               
#define EIP1_PCP0R__HIGH   0x20 ///< CP0 rising edge interrupt priority set to high.              
                                                                                                  
