ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define EIP1_PCP1__BMASK   0x40 ///< Comparator1 (CP1) Interrupt Priority Control                 
#define EIP1_PCP1__SHIFT   0x06 ///< Comparator1 (CP1) Interrupt Priority Control                 
#define EIP1_PCP1__LOW     0x00 ///< CP1 interrupt set to low priority level.                     
#define EIP1_PCP1__HIGH    0x40 ///< CP1 interrupt set to high priority level.                    
                                                                                                  
#define EIP1_PCP1F__BMASK  0x40 ///< Comparator1 (CP1) Falling Edge Interrupt Priority Control    
#define EIP1_PCP1F__SHIFT  0x06 ///< Comparator1 (CP1) Falling Edge Interrupt Priority Control    
#define EIP1_PCP1F__LOW    0x00 ///< CP1 falling edge interrupt priority set to low.              
#define EIP1_PCP1F__HIGH   0x40 ///< CP1 falling edge interrupt priority set to high.             
                                                                                                  
#define EIP1_PCP1R__BMASK  0x80 ///< Comparator1 (CP1) Rising Edge Interrupt Priority Control     
#define EIP1_PCP1R__SHIFT  0x07 ///< Comparator1 (CP1) Rising Edge Interrupt Priority Control     
#define EIP1_PCP1R__LOW    0x00 ///< CP1 rising edge interrupt priority set to low.               
#define EIP1_PCP1R__HIGH   0x80 ///< CP1 rising edge interrupt priority set to high.              
                                                                                                  
#define EIP1_PT3__BMASK    0x80 ///< Timer 3 Interrupt Priority Control                           
#define EIP1_PT3__SHIFT    0x07 ///< Timer 3 Interrupt Priority Control                           
#define EIP1_PT3__LOW      0x00 ///< Timer 3 interrupts set to low priority level.                
#define EIP1_PT3__HIGH     0x80 ///< Timer 3 interrupts set to high priority level.               
                                                                                                  
//------------------------------------------------------------------------------
// EIP2 Enums (Extended Interrupt Priority 2 @ 0xF7)
//------------------------------------------------------------------------------
#define EIP2_PT3__BMASK    0x01 ///< Timer 3 Interrupt Priority Control                 
#define EIP2_PT3__SHIFT    0x00 ///< Timer 3 Interrupt Priority Control                 
#define EIP2_PT3__LOW      0x00 ///< CP1 interrupt priority set to low.                 
#define EIP2_PT3__HIGH     0x01 ///< CP1 interrupt priority set to high.                
                                                                                        
#define EIP2_PADC0__BMASK  0x02 ///< ADC0 Conversion Complete Interrupt Priority Control
#define EIP2_PADC0__SHIFT  0x01 ///< ADC0 Conversion Complete Interrupt Priority Control
#define EIP2_PADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt priority set to 
                                ///< low.                                               
#define EIP2_PADC0__HIGH   0x02 ///< ADC0 Conversion Complete interrupt priority set to 
                                ///< high.                                              
                                                                                        
#define EIP2_PT4__BMASK    0x04 ///< Timer 4 Interrupt Priority Control                 
#define EIP2_PT4__SHIFT    0x02 ///< Timer 4 Interrupt Priority Control                 
#define EIP2_PT4__LOW      0x00 ///< Timer 4 interrupt priority set to low.             
#define EIP2_PT4__HIGH     0x04 ///< Timer 4 interrupt priority set to high.            
                                                                                        
#define EIP2_PWADC2__BMASK 0x08 ///< ADC2 Window Comparator Interrupt Priority Control  
#define EIP2_PWADC2__SHIFT 0x03 ///< ADC2 Window Comparator Interrupt Priority Control  
#define EIP2_PWADC2__LOW   0x00 ///< ADC2 Conversion Complete interrupt priority set to 
                                ///< low.                                               
#define EIP2_PWADC2__HIGH  0x08 ///< ADC2 Conversion Complete interrupt priority set to 
                                ///< high.                                              
                                                                                        
#define EIP2_PADC2__BMASK  0x10 ///< ADC2 Conversion Complete Interrupt Priority Control
#define EIP2_PADC2__SHIFT  0x04 ///< ADC2 Conversion Complete Interrupt Priority Control
#define EIP2_PADC2__LOW    0x00 ///< ADC2 Conversion Complete interrupt priority set to 
                                ///< low.                                               
#define EIP2_PADC2__HIGH   0x10 ///< ADC2 Conversion Complete interrupt priority set to 
                                ///< high.                                              
                                                                                        
#define EIP2_PS1__BMASK    0x40 ///< UART1 Interrupt Priority Control                   
#define EIP2_PS1__SHIFT    0x06 ///< UART1 Interrupt Priority Control                   
#define EIP2_PS1__LOW      0x00 ///< UART1 interrupt priority set to low.               
#define EIP2_PS1__HIGH     0x40 ///< UART1 interrupt priority set to high.              
                                                                                        
//------------------------------------------------------------------------------
// IE Enums (Interrupt Enable @ 0xA8)
//------------------------------------------------------------------------------
#define IE_EX0__BMASK      0x01 ///< External Interrupt 0 Enable                       
#define IE_EX0__SHIFT      0x00 ///< External Interrupt 0 Enable                       
#define IE_EX0__DISABLED   0x00 ///< Disable external interrupt 0.                     
#define IE_EX0__ENABLED    0x01 ///< Enable interrupt requests generated by the INT0   
                                ///< input.                                            
                                                                                       
#define IE_ET0__BMASK      0x02 ///< Timer 0 Interrupt Enable                          
#define IE_ET0__SHIFT      0x01 ///< Timer 0 Interrupt Enable                          
#define IE_ET0__DISABLED   0x00 ///< Disable all Timer 0 interrupt.                    
#define IE_ET0__ENABLED    0x02 ///< Enable interrupt requests generated by the TF0    
                                ///< flag.                                             
                                                                                       
#define IE_EX1__BMASK      0x04 ///< External Interrupt 1 Enable                       
#define IE_EX1__SHIFT      0x02 ///< External Interrupt 1 Enable                       
#define IE_EX1__DISABLED   0x00 ///< Disable external interrupt 1.                     
#define IE_EX1__ENABLED    0x04 ///< Enable interrupt requests generated by the INT1   
                                ///< input.                                            
                                                                                       
#define IE_ET1__BMASK      0x08 ///< Timer 1 Interrupt Enable                          
#define IE_ET1__SHIFT      0x03 ///< Timer 1 Interrupt Enable                          
#define IE_ET1__DISABLED   0x00 ///< Disable all Timer 1 interrupt.                    
#define IE_ET1__ENABLED    0x08 ///< Enable interrupt requests generated by the TF1    
                                ///< flag.                                             
                                                                                       
#define IE_ES0__BMASK      0x10 ///< UART0 Interrupt Enable                            
#define IE_ES0__SHIFT      0x04 ///< UART0 Interrupt Enable                            
#define IE_ES0__DISABLED   0x00 ///< Disable UART0 interrupt.                          
#define IE_ES0__ENABLED    0x10 ///< Enable UART0 interrupt.                           
                                                                                       
#define IE_ET2__BMASK      0x20 ///< Timer 2 Interrupt Enable                          
#define IE_ET2__SHIFT      0x05 ///< Timer 2 Interrupt Enable                          
#define IE_ET2__DISABLED   0x00 ///< Disable Timer 2 interrupt.                        
#define IE_ET2__ENABLED    0x20 ///< Enable interrupt requests generated by the TF2L or
                                ///< TF2H flags.                                       
                                                                                       
#define IE_ESPI0__BMASK    0x40 ///< SPI0 Interrupt Enable                             
#define IE_ESPI0__SHIFT    0x06 ///< SPI0 Interrupt Enable                             
#define IE_ESPI0__DISABLED 0x00 ///< Disable all SPI0 interrupts.                      
#define IE_ESPI0__ENABLED  0x40 ///< Enable interrupt requests generated by SPI0.      
                                                                                       
#define IE_IEGF0__BMASK    0x40 ///< General Purpose Flag 0                            
#define IE_IEGF0__SHIFT    0x06 ///< General Purpose Flag 0                            
#define IE_IEGF0__NOT_SET  0x00 ///< The flag is not set. Clear the flag.              
#define IE_IEGF0__SET      0x40 ///< The flag is set. Set the flag.                    
                                                                                       
#define IE_EA__BMASK       0x80 ///< All Interrupts Enable                             
#define IE_EA__SHIFT       0x07 ///< All Interrupts Enable                             
#define IE_EA__DISABLED    0x00 ///< Disable all interrupt sources.                    
#define IE_EA__ENABLED     0x80 ///< Enable each interrupt according to its individual 
                                ///< mask setting.                                     
                                                                                       
//------------------------------------------------------------------------------
// IP Enums (Interrupt Priority @ 0xB8)
//------------------------------------------------------------------------------
#define IP_PX0__BMASK   0x01 ///< External Interrupt 0 Priority Control                        
#define IP_PX0__SHIFT   0x00 ///< External Interrupt 0 Priority Control                        
#define IP_PX0__LOW     0x00 ///< External Interrupt 0 priority set to low.                    
#define IP_PX0__HIGH    0x01 ///< External Interrupt 0 priority set to high.                   
                                                                                               
#define IP_PT0__BMASK   0x02 ///< Timer 0 Interrupt Priority Control                           
#define IP_PT0__SHIFT   0x01 ///< Timer 0 Interrupt Priority Control                           
#define IP_PT0__LOW     0x00 ///< Timer 0 interrupt priority set to low.                       
#define IP_PT0__HIGH    0x02 ///< Timer 0 interrupt priority set to high.                      
                                                                                               
#define IP_PX1__BMASK   0x04 ///< External Interrupt 1 Priority Control                        
#define IP_PX1__SHIFT   0x02 ///< External Interrupt 1 Priority Control                        
#define IP_PX1__LOW     0x00 ///< External Interrupt 1 priority set to low.                    
#define IP_PX1__HIGH    0x04 ///< External Interrupt 1 priority set to high.                   
                                                                                               
