ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define IP_PT1__BMASK   0x08 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__SHIFT   0x03 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__LOW     0x00 ///< Timer 1 interrupt priority set to low.                       
#define IP_PT1__HIGH    0x08 ///< Timer 1 interrupt priority set to high.                      
                                                                                               
#define IP_PS0__BMASK   0x10 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__SHIFT   0x04 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__LOW     0x00 ///< UART0 interrupt priority set to low.                         
#define IP_PS0__HIGH    0x10 ///< UART0 interrupt priority set to high.                        
                                                                                               
#define IP_PT2__BMASK   0x20 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__SHIFT   0x05 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__LOW     0x00 ///< Timer 2 interrupt priority set to low.                       
#define IP_PT2__HIGH    0x20 ///< Timer 2 interrupt priority set to high.                      
                                                                                               
#define IP_PSPI0__BMASK 0x40 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__SHIFT 0x06 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__LOW   0x00 ///< SPI0 interrupt set to low priority level.                    
#define IP_PSPI0__HIGH  0x40 ///< SPI0 interrupt set to high priority level.                   
                                                                                               
//------------------------------------------------------------------------------
// DEVICEID Enums (JTAG Device ID @ 0x04)
//------------------------------------------------------------------------------
#define DEVICEID_DEVICEID__FMASK 0xFFFFFFFF ///< Device ID
#define DEVICEID_DEVICEID__SHIFT 0x00       ///< Device ID
                                                          
//------------------------------------------------------------------------------
// FLASHADR Enums (JTAG Flash Address @ 0x84)
//------------------------------------------------------------------------------
#define FLASHADR_FLASHADR__FMASK 0x1FFFF ///< Flash Operation 17-bit Address
#define FLASHADR_FLASHADR__SHIFT 0x00    ///< Flash Operation 17-bit Address
                                                                            
//------------------------------------------------------------------------------
// FLASHCON Enums (JTAG Flash Control @ 0x82)
//------------------------------------------------------------------------------
#define FLASHCON_RDMD__FMASK 0x0F ///< Read Mode Select                     
#define FLASHCON_RDMD__SHIFT 0x00 ///< Read Mode Select                     
                                                                            
#define FLASHCON_WRMD__FMASK 0x70 ///< Write Mode Select                    
#define FLASHCON_WRMD__SHIFT 0x04 ///< Write Mode Select                    
                                                                            
#define FLASHCON_SFLE__BMASK 0x80 ///< Scratchpad Flash Memory Access Enable
#define FLASHCON_SFLE__SHIFT 0x07 ///< Scratchpad Flash Memory Access Enable
                                                                            
//------------------------------------------------------------------------------
// FLASHDAT Enums (JTAG Flash Data @ 0x83)
//------------------------------------------------------------------------------
#define FLASHDAT_BUSY__BMASK 0x01  ///< Flash Busy     
#define FLASHDAT_BUSY__SHIFT 0x00  ///< Flash Busy     
                                                       
#define FLASHDAT_FAIL__BMASK 0x02  ///< Flash Fail     
#define FLASHDAT_FAIL__SHIFT 0x01  ///< Flash Fail     
                                                       
#define FLASHDAT_DATA__FMASK 0x3FC ///< Flash Data Byte
#define FLASHDAT_DATA__SHIFT 0x02  ///< Flash Data Byte
                                                       
//------------------------------------------------------------------------------
// MAC0ACC0 Enums (Accumulator Byte 0 @ 0x93)
//------------------------------------------------------------------------------
#define MAC0ACC0_MAC0ACC0__FMASK 0xFF ///< MAC0 Accumulator Byte 0
#define MAC0ACC0_MAC0ACC0__SHIFT 0x00 ///< MAC0 Accumulator Byte 0
                                                                  
//------------------------------------------------------------------------------
// MAC0ACC1 Enums (Accumulator Byte 1 @ 0x94)
//------------------------------------------------------------------------------
#define MAC0ACC1_MAC0ACC1__FMASK 0xFF ///< MAC0 Accumulator Byte 1
#define MAC0ACC1_MAC0ACC1__SHIFT 0x00 ///< MAC0 Accumulator Byte 1
                                                                  
//------------------------------------------------------------------------------
// MAC0ACC2 Enums (Accumulator Byte 2 @ 0x95)
//------------------------------------------------------------------------------
#define MAC0ACC2_MAC0ACC2__FMASK 0xFF ///< MAC0 Accumulator Byte 2
#define MAC0ACC2_MAC0ACC2__SHIFT 0x00 ///< MAC0 Accumulator Byte 2
                                                                  
//------------------------------------------------------------------------------
// MAC0ACC3 Enums (Accumulator Byte 3 @ 0x96)
//------------------------------------------------------------------------------
#define MAC0ACC3_MAC0ACC3__FMASK 0xFF ///< MAC0 Accumulator Byte 3
#define MAC0ACC3_MAC0ACC3__SHIFT 0x00 ///< MAC0 Accumulator Byte 3
                                                                  
//------------------------------------------------------------------------------
// MAC0AH Enums (Operand A High Byte @ 0xC2)
//------------------------------------------------------------------------------
#define MAC0AH_MAC0AH__FMASK 0xFF ///< MAC0 A High Byte
#define MAC0AH_MAC0AH__SHIFT 0x00 ///< MAC0 A High Byte
                                                       
//------------------------------------------------------------------------------
// MAC0AL Enums (Operand A Low Byte @ 0xC1)
//------------------------------------------------------------------------------
#define MAC0AL_MAC0AL__FMASK 0xFF ///< MAC0 A Low Byte
#define MAC0AL_MAC0AL__SHIFT 0x00 ///< MAC0 A Low Byte
                                                      
//------------------------------------------------------------------------------
// MAC0BH Enums (Operand B High Byte @ 0x92)
//------------------------------------------------------------------------------
#define MAC0BH_MAC0BH__FMASK 0xFF ///< MAC0 B High Byte
#define MAC0BH_MAC0BH__SHIFT 0x00 ///< MAC0 B High Byte
                                                       
//------------------------------------------------------------------------------
// MAC0BL Enums (Operand B Low Byte @ 0x91)
//------------------------------------------------------------------------------
#define MAC0BL_MAC0BL__FMASK 0xFF ///< MAC0 B Low Byte
#define MAC0BL_MAC0BL__SHIFT 0x00 ///< MAC0 B Low Byte
                                                      
//------------------------------------------------------------------------------
// MAC0CF Enums (MAC0 Configuration @ 0xC3)
//------------------------------------------------------------------------------
#define MAC0CF_ACCMD__BMASK       0x01 ///< Accumulate Mode                                 
#define MAC0CF_ACCMD__SHIFT       0x00 ///< Accumulate Mode                                 
#define MAC0CF_ACCMD__MAC_MODE    0x00 ///< Select multiply-and-accumulate (MAC) mode.      
#define MAC0CF_ACCMD__MUL_MODE    0x01 ///< Select multiply-only mode.                      
                                                                                            
#define MAC0CF_FRACMD__BMASK      0x02 ///< Fractional Mode                                 
#define MAC0CF_FRACMD__SHIFT      0x01 ///< Fractional Mode                                 
#define MAC0CF_FRACMD__INT_MODE   0x00 ///< MAC0 operates in Integer Mode.                  
#define MAC0CF_FRACMD__FRAC_MODE  0x02 ///< MAC0 operates in Fractional Mode.               
                                                                                            
#define MAC0CF_SATURATE__BMASK    0x04 ///< Saturation Enable                               
#define MAC0CF_SATURATE__SHIFT    0x02 ///< Saturation Enable                               
#define MAC0CF_SATURATE__DISABLED 0x00 ///< Rounded result will not saturate.               
#define MAC0CF_SATURATE__ENABLED  0x04 ///< Rounded result will saturate.                   
                                                                                            
#define MAC0CF_CLRACC__BMASK      0x08 ///< Clear Accumulator                               
#define MAC0CF_CLRACC__SHIFT      0x03 ///< Clear Accumulator                               
#define MAC0CF_CLRACC__COMPLETED  0x00 ///< The accumulator clear operation completed.      
#define MAC0CF_CLRACC__START      0x08 ///< Clear the accumulator and the related MAC0STA   
                                       ///< register flags.                                 
                                                                                            
