ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define MAC0CF_SHIFTDIR__BMASK    0x10 ///< Accumulator Shift Direction                     
#define MAC0CF_SHIFTDIR__SHIFT    0x04 ///< Accumulator Shift Direction                     
#define MAC0CF_SHIFTDIR__LEFT     0x00 ///< The MAC0 accumulator will be shifted left.      
#define MAC0CF_SHIFTDIR__RIGHT    0x10 ///< The MAC0 accumulator will be shifted right.     
                                                                                            
#define MAC0CF_SHIFTEN__BMASK     0x20 ///< Accumulator Shift Control                       
#define MAC0CF_SHIFTEN__SHIFT     0x05 ///< Accumulator Shift Control                       
#define MAC0CF_SHIFTEN__COMPLETED 0x00 ///< The shift operation completed.                  
#define MAC0CF_SHIFTEN__START     0x20 ///< Shift the accumulator by one bit in the SHIFTDIR
                                       ///< direction.                                      
                                                                                            
//------------------------------------------------------------------------------
// MAC0OVR Enums (Accumulator Overflow Byte @ 0x97)
//------------------------------------------------------------------------------
#define MAC0OVR_MAC0OVF__FMASK 0xFF ///< MAC0 Accumulator Overflow Byte
#define MAC0OVR_MAC0OVF__SHIFT 0x00 ///< MAC0 Accumulator Overflow Byte
                                                                       
//------------------------------------------------------------------------------
// MAC0RNDH Enums (Rounded Result High Byte @ 0xCF)
//------------------------------------------------------------------------------
#define MAC0RNDH_MAC0RND__FMASK 0xFF ///< Rounded Result High
#define MAC0RNDH_MAC0RND__SHIFT 0x00 ///< Rounded Result High
                                                             
//------------------------------------------------------------------------------
// MAC0RNDL Enums (Rounded Result Low Byte @ 0xCE)
//------------------------------------------------------------------------------
#define MAC0RNDL_MAC0RND__FMASK 0xFF ///< Rounded Result Low
#define MAC0RNDL_MAC0RND__SHIFT 0x00 ///< Rounded Result Low
                                                            
//------------------------------------------------------------------------------
// MAC0STA Enums (MAC0 Status @ 0xC0)
//------------------------------------------------------------------------------
#define MAC0STA_NEGF__BMASK    0x01 ///< Negative Flag                                
#define MAC0STA_NEGF__SHIFT    0x00 ///< Negative Flag                                
#define MAC0STA_NEGF__NOT_SET  0x00 ///< The accumulator result is zero or positive.  
#define MAC0STA_NEGF__SET      0x01 ///< The accumulator result is negative.          
                                                                                      
#define MAC0STA_SOVF__BMASK    0x02 ///< Soft Overflow Flag                           
#define MAC0STA_SOVF__SHIFT    0x01 ///< Soft Overflow Flag                           
#define MAC0STA_SOVF__NOT_SET  0x00 ///< A soft overflow did not occur.               
#define MAC0STA_SOVF__SET      0x02 ///< A soft overflow occurred.                    
                                                                                      
#define MAC0STA_ZEROF__BMASK   0x04 ///< Zero Flag                                    
#define MAC0STA_ZEROF__SHIFT   0x02 ///< Zero Flag                                    
#define MAC0STA_ZEROF__NOT_SET 0x00 ///< The last operation did not result in an      
                                    ///< accumulator value of zero.                   
#define MAC0STA_ZEROF__SET     0x04 ///< The last operation resulted in an accumulator
                                    ///< value of zero.                               
                                                                                      
#define MAC0STA_HOVF__BMASK    0x08 ///< Hard Overflow Flag                           
#define MAC0STA_HOVF__SHIFT    0x03 ///< Hard Overflow Flag                           
#define MAC0STA_HOVF__NOT_SET  0x00 ///< A hardware overflow did not occur.           
#define MAC0STA_HOVF__SET      0x08 ///< A hardware overflow occurred.                
                                                                                      
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_SMB0EN__BMASK                         0x01 ///< SMBus0 I/O Enable                                
#define XBR0_SMB0EN__SHIFT                         0x00 ///< SMBus0 I/O Enable                                
#define XBR0_SMB0EN__DISABLED                      0x00 ///< SMBus0 I/O unavailable at Port pins.             
#define XBR0_SMB0EN__ENABLED                       0x01 ///< SMBus0 I/O routed to Port pins.                  
                                                                                                              
#define XBR0_SPI0EN__BMASK                         0x02 ///< SPI I/O Enable                                   
#define XBR0_SPI0EN__SHIFT                         0x01 ///< SPI I/O Enable                                   
#define XBR0_SPI0EN__DISABLED                      0x00 ///< SPI I/O unavailable at Port pins.                
#define XBR0_SPI0EN__ENABLED                       0x02 ///< SPI I/O routed to Port pins. The SPI can be      
                                                        ///< assigned either 3 or 4 GPIO pins.                
                                                                                                              
#define XBR0_UART0EN__BMASK                        0x04 ///< UART I/O Output Enable                           
#define XBR0_UART0EN__SHIFT                        0x02 ///< UART I/O Output Enable                           
#define XBR0_UART0EN__DISABLED                     0x00 ///< UART I/O unavailable at Port pin.                
#define XBR0_UART0EN__ENABLED                      0x04 ///< UART TX, RX routed to Port pins P0.0 and P0.1.   
                                                                                                              
