ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define XBR0_PCA0ME__FMASK                         0x38 ///< PCA Module I/O Enable                            
#define XBR0_PCA0ME__SHIFT                         0x03 ///< PCA Module I/O Enable                            
#define XBR0_PCA0ME__DISABLED                      0x00 ///< All PCA I/O unavailable at Port pins.            
#define XBR0_PCA0ME__CEX0                          0x08 ///< CEX0 routed to Port pin.                         
#define XBR0_PCA0ME__CEX0_CEX1                     0x10 ///< CEX0, CEX1 routed to Port pins.                  
#define XBR0_PCA0ME__CEX0_CEX1_CEX2                0x18 ///< CEX0, CEX1, CEX2 routed to Port pins.            
#define XBR0_PCA0ME__CEX0_CEX1_CEX2_CEX3           0x20 ///< CEX0, CEX1, CEX2, CEX3 routed to Port pins.      
#define XBR0_PCA0ME__CEX0_CEX1_CEX2_CEX3_CEX4      0x28 ///< CEX0, CEX1, CEX2, CEX3, CEX4 routed to Port pins.
#define XBR0_PCA0ME__CEX0_CEX1_CEX2_CEX3_CEX4_CEX5 0x30 ///< CEX0, CEX1, CEX2, CEX3, CEX4, CEX5 routed to Port
                                                        ///< pins.                                            
                                                                                                              
#define XBR0_ECI0E__BMASK                          0x40 ///< PCA0 External Counter Input Enable               
#define XBR0_ECI0E__SHIFT                          0x06 ///< PCA0 External Counter Input Enable               
#define XBR0_ECI0E__DISABLED                       0x00 ///< ECI unavailable at Port pin.                     
#define XBR0_ECI0E__ENABLED                        0x40 ///< ECI routed to Port pin.                          
                                                                                                              
#define XBR0_CP0E__BMASK                           0x80 ///< Comparator0 Output Enable                        
#define XBR0_CP0E__SHIFT                           0x07 ///< Comparator0 Output Enable                        
#define XBR0_CP0E__DISABLED                        0x00 ///< CP0 unavailable at Port pin.                     
#define XBR0_CP0E__ENABLED                         0x80 ///< CP0 routed to Port pin.                          
                                                                                                              
//------------------------------------------------------------------------------
// XBR1 Enums (Port I/O Crossbar 1 @ 0xE2)
//------------------------------------------------------------------------------
#define XBR1_CP1E__BMASK      0x01 ///< Comparator1 Output Enable        
#define XBR1_CP1E__SHIFT      0x00 ///< Comparator1 Output Enable        
#define XBR1_CP1E__DISABLED   0x00 ///< CP1 unavailable at Port pin.     
#define XBR1_CP1E__ENABLED    0x01 ///< CP1 routed to Port pin.          
                                                                         
#define XBR1_T0E__BMASK       0x02 ///< T0 Enable                        
#define XBR1_T0E__SHIFT       0x01 ///< T0 Enable                        
#define XBR1_T0E__DISABLED    0x00 ///< T0 unavailable at Port pin.      
#define XBR1_T0E__ENABLED     0x02 ///< T0 routed to Port pin.           
                                                                         
#define XBR1_INT0E__BMASK     0x04 ///< /INT0 Input Enable               
#define XBR1_INT0E__SHIFT     0x02 ///< /INT0 Input Enable               
#define XBR1_INT0E__DISABLED  0x00 ///< /INT0 unavailable at Port pin.   
#define XBR1_INT0E__ENABLED   0x04 ///< /INT0 routed to Port pin.        
                                                                         
#define XBR1_T1E__BMASK       0x08 ///< T1 Enable                        
#define XBR1_T1E__SHIFT       0x03 ///< T1 Enable                        
#define XBR1_T1E__DISABLED    0x00 ///< T1 unavailable at Port pin.      
#define XBR1_T1E__ENABLED     0x08 ///< T1 routed to Port pin.           
                                                                         
#define XBR1_INT1E__BMASK     0x10 ///< /INT1 Input Enable               
#define XBR1_INT1E__SHIFT     0x04 ///< /INT1 Input Enable               
#define XBR1_INT1E__DISABLED  0x00 ///< /INT1 unavailable at Port pin.   
#define XBR1_INT1E__ENABLED   0x10 ///< /INT1 routed to Port pin.        
                                                                         
#define XBR1_T2E__BMASK       0x20 ///< T2 Enable                        
#define XBR1_T2E__SHIFT       0x05 ///< T2 Enable                        
#define XBR1_T2E__DISABLED    0x00 ///< T2 unavailable at Port pin.      
#define XBR1_T2E__ENABLED     0x20 ///< T2 routed to Port pin.           
                                                                         
#define XBR1_T2EXE__BMASK     0x40 ///< T2EX Input Enable                
#define XBR1_T2EXE__SHIFT     0x06 ///< T2EX Input Enable                
#define XBR1_T2EXE__DISABLED  0x00 ///< T2EX unavailable at Port pin.    
#define XBR1_T2EXE__ENABLED   0x40 ///< T2EX routed to Port pin.         
                                                                         
#define XBR1_SYSCKE__BMASK    0x80 ///< SYSCLK Output Enable             
#define XBR1_SYSCKE__SHIFT    0x07 ///< SYSCLK Output Enable             
#define XBR1_SYSCKE__DISABLED 0x00 ///< SYSCLK unavailable at Port pin.  
#define XBR1_SYSCKE__ENABLED  0x80 ///< SYSCLK output routed to Port pin.
                                                                         
//------------------------------------------------------------------------------
// XBR2 Enums (Port I/O Crossbar 2 @ 0xE3)
//------------------------------------------------------------------------------
#define XBR2_CNVST0E__BMASK             0x01 ///< ADC0 External Convert Start Input Enable          
#define XBR2_CNVST0E__SHIFT             0x00 ///< ADC0 External Convert Start Input Enable          
#define XBR2_CNVST0E__DISABLED          0x00 ///< CNVSTR0 for ADC0 unavailable at Port pin.         
#define XBR2_CNVST0E__ENABLED           0x01 ///< CNVSTR0 for ADC0 routed to Port pin.              
                                                                                                    
#define XBR2_EMIFLE__BMASK              0x02 ///< External Memory Interface Low-Port Enable         
#define XBR2_EMIFLE__SHIFT              0x01 ///< External Memory Interface Low-Port Enable         
#define XBR2_EMIFLE__DISABLED           0x00 ///< P0.7, P0.6, and P0.5 functions are determined by  
                                             ///< the Crossbar or the Port latches.                 
#define XBR2_EMIFLE__ENABLED            0x02 ///< If EMI0CF.4 = 0 (External Memory Interface is in  
                                             ///< Multiplexed mode), P0.7 (/WR), P0.6 (/RD), and    
                                             ///< P0.5 (ALE) are skipped by the Crossbar and their  
                                             ///< output states are determined by the Port latches  
                                             ///< and the External Memory Interface. If EMI0CF.4 = 1
                                             ///< (External Memory Interface is in Non-multiplexed  
                                             ///< mode), P0.7 (/WR) and P0.6 (/RD) are skipped by   
                                             ///< the Crossbar and their output.                    
                                                                                                    
