ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define XBR2_UART1E__BMASK              0x04 ///< UART I/O Output Enable                            
#define XBR2_UART1E__SHIFT              0x02 ///< UART I/O Output Enable                            
#define XBR2_UART1E__DISABLED           0x00 ///< UART I/O unavailable at Port pin.                 
#define XBR2_UART1E__ENABLED            0x04 ///< UART TX, RX routed to Port pins.                  
                                                                                                    
#define XBR2_T4E__BMASK                 0x08 ///< T4 Enable                                         
#define XBR2_T4E__SHIFT                 0x03 ///< T4 Enable                                         
#define XBR2_T4E__DISABLED              0x00 ///< T4 unavailable at Port pin.                       
#define XBR2_T4E__ENABLED               0x08 ///< T4 routed to Port pin.                            
                                                                                                    
#define XBR2_T4EXE__BMASK               0x10 ///< T4EX Input Enable                                 
#define XBR2_T4EXE__SHIFT               0x04 ///< T4EX Input Enable                                 
#define XBR2_T4EXE__DISABLED            0x00 ///< T4EX unavailable at Port pin.                     
#define XBR2_T4EXE__ENABLED             0x10 ///< T4EX routed to Port pin.                          
                                                                                                    
#define XBR2_CNVST2E__BMASK             0x20 ///< ADC2 External Convert Start Input Enable          
#define XBR2_CNVST2E__SHIFT             0x05 ///< ADC2 External Convert Start Input Enable          
#define XBR2_CNVST2E__DISABLED          0x00 ///< CNVSTR2 for ADC2 unavailable at Port pin.         
#define XBR2_CNVST2E__ENABLED           0x20 ///< CNVSTR2 for ADC2 routed to Port pin.              
                                                                                                    
#define XBR2_XBARE__BMASK               0x40 ///< Crossbar Enable                                   
#define XBR2_XBARE__SHIFT               0x06 ///< Crossbar Enable                                   
#define XBR2_XBARE__DISABLED            0x00 ///< Crossbar disabled.                                
#define XBR2_XBARE__ENABLED             0x40 ///< Crossbar enabled.                                 
                                                                                                    
#define XBR2_WEAKPUD__BMASK             0x80 ///< Port I/O Weak Pullup Disable                      
#define XBR2_WEAKPUD__SHIFT             0x07 ///< Port I/O Weak Pullup Disable                      
#define XBR2_WEAKPUD__PULL_UPS_ENABLED  0x00 ///< Weak Pullups enabled (except for Ports whose I/O  
                                             ///< are configured for analog mode).                  
#define XBR2_WEAKPUD__PULL_UPS_DISABLED 0x80 ///< Weak Pullups disabled.                            
                                                                                                    
//------------------------------------------------------------------------------
// PCA0CPH0 Enums (PCA Channel 0 Capture Module High Byte @ 0xFC)
//------------------------------------------------------------------------------
#define PCA0CPH0_PCA0CPH0__FMASK 0xFF ///< PCA Channel 0 Capture Module High Byte
#define PCA0CPH0_PCA0CPH0__SHIFT 0x00 ///< PCA Channel 0 Capture Module High Byte
                                                                                 
//------------------------------------------------------------------------------
// PCA0CPL0 Enums (PCA Channel 0 Capture Module Low Byte @ 0xFB)
//------------------------------------------------------------------------------
#define PCA0CPL0_PCA0CPL0__FMASK 0xFF ///< PCA Channel 0 Capture Module Low Byte
#define PCA0CPL0_PCA0CPL0__SHIFT 0x00 ///< PCA Channel 0 Capture Module Low Byte
                                                                                
//------------------------------------------------------------------------------
// PCA0CPM0 Enums (PCA Channel 0 Capture/Compare Mode @ 0xDA)
//------------------------------------------------------------------------------
#define PCA0CPM0_ECCF__BMASK    0x01 ///< Channel 0 Capture/Compare Flag Interrupt Enable
#define PCA0CPM0_ECCF__SHIFT    0x00 ///< Channel 0 Capture/Compare Flag Interrupt Enable
#define PCA0CPM0_ECCF__DISABLED 0x00 ///< Disable CCF0 interrupts.                       
#define PCA0CPM0_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request
                                     ///< when CCF0 is set.                              
                                                                                         
#define PCA0CPM0_PWM__BMASK     0x02 ///< Channel 0 Pulse Width Modulation Mode Enable   
#define PCA0CPM0_PWM__SHIFT     0x01 ///< Channel 0 Pulse Width Modulation Mode Enable   
#define PCA0CPM0_PWM__DISABLED  0x00 ///< Disable PWM function.                          
#define PCA0CPM0_PWM__ENABLED   0x02 ///< Enable PWM function.                           
                                                                                         
#define PCA0CPM0_TOG__BMASK     0x04 ///< Channel 0 Toggle Function Enable               
#define PCA0CPM0_TOG__SHIFT     0x02 ///< Channel 0 Toggle Function Enable               
#define PCA0CPM0_TOG__DISABLED  0x00 ///< Disable toggle function.                       
#define PCA0CPM0_TOG__ENABLED   0x04 ///< Enable toggle function.                        
                                                                                         
#define PCA0CPM0_MAT__BMASK     0x08 ///< Channel 0 Match Function Enable                
#define PCA0CPM0_MAT__SHIFT     0x03 ///< Channel 0 Match Function Enable                
#define PCA0CPM0_MAT__DISABLED  0x00 ///< Disable match function.                        
#define PCA0CPM0_MAT__ENABLED   0x08 ///< Enable match function.                         
                                                                                         
#define PCA0CPM0_CAPN__BMASK    0x10 ///< Channel 0 Capture Negative Function Enable     
#define PCA0CPM0_CAPN__SHIFT    0x04 ///< Channel 0 Capture Negative Function Enable     
#define PCA0CPM0_CAPN__DISABLED 0x00 ///< Disable negative edge capture.                 
#define PCA0CPM0_CAPN__ENABLED  0x10 ///< Enable negative edge capture.                  
                                                                                         
