ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define PCA0CN_CCF2__BMASK   0x04 ///< PCA Module 2 Capture/Compare Flag             
#define PCA0CN_CCF2__SHIFT   0x02 ///< PCA Module 2 Capture/Compare Flag             
#define PCA0CN_CCF2__NOT_SET 0x00 ///< A match or capture did not occur on channel 2.
#define PCA0CN_CCF2__SET     0x04 ///< A match or capture occurred on channel 2.     
                                                                                     
#define PCA0CN_CCF3__BMASK   0x08 ///< PCA Module 3 Capture/Compare Flag             
#define PCA0CN_CCF3__SHIFT   0x03 ///< PCA Module 3 Capture/Compare Flag             
#define PCA0CN_CCF3__NOT_SET 0x00 ///< A match or capture did not occur on channel 3.
#define PCA0CN_CCF3__SET     0x08 ///< A match or capture occurred on channel 3.     
                                                                                     
#define PCA0CN_CCF4__BMASK   0x10 ///< PCA Module 4 Capture/Compare Flag             
#define PCA0CN_CCF4__SHIFT   0x04 ///< PCA Module 4 Capture/Compare Flag             
#define PCA0CN_CCF4__NOT_SET 0x00 ///< A match or capture did not occur on channel 4.
#define PCA0CN_CCF4__SET     0x10 ///< A match or capture occurred on channel 4.     
                                                                                     
#define PCA0CN_CCF5__BMASK   0x20 ///< PCA Module 5 Capture/Compare Flag             
#define PCA0CN_CCF5__SHIFT   0x05 ///< PCA Module 5 Capture/Compare Flag             
#define PCA0CN_CCF5__NOT_SET 0x00 ///< A match or capture did not occur on channel 5.
#define PCA0CN_CCF5__SET     0x20 ///< A match or capture occurred on channel 5.     
                                                                                     
#define PCA0CN_CR__BMASK     0x40 ///< PCA Counter/Timer Run Control                 
#define PCA0CN_CR__SHIFT     0x06 ///< PCA Counter/Timer Run Control                 
#define PCA0CN_CR__STOP      0x00 ///< Stop the PCA Counter/Timer.                   
#define PCA0CN_CR__RUN       0x40 ///< Start the PCA Counter/Timer running.          
                                                                                     
#define PCA0CN_CF__BMASK     0x80 ///< PCA Counter/Timer Overflow Flag               
#define PCA0CN_CF__SHIFT     0x07 ///< PCA Counter/Timer Overflow Flag               
#define PCA0CN_CF__NOT_SET   0x00 ///< The PCA counter/timer did not overflow.       
#define PCA0CN_CF__SET       0x80 ///< The PCA counter/timer overflowed.             
                                                                                     
//------------------------------------------------------------------------------
// PCA0H Enums (PCA Counter/Timer High Byte @ 0xFA)
//------------------------------------------------------------------------------
#define PCA0H_PCA0H__FMASK 0xFF ///< PCA Counter/Timer High Byte
#define PCA0H_PCA0H__SHIFT 0x00 ///< PCA Counter/Timer High Byte
                                                                
//------------------------------------------------------------------------------
// PCA0L Enums (PCA Counter/Timer Low Byte @ 0xF9)
//------------------------------------------------------------------------------
#define PCA0L_PCA0L__FMASK 0xFF ///< PCA Counter/Timer Low Byte
#define PCA0L_PCA0L__SHIFT 0x00 ///< PCA Counter/Timer Low Byte
                                                               
//------------------------------------------------------------------------------
// PCA0MD Enums (PCA Mode @ 0xD9)
//------------------------------------------------------------------------------
#define PCA0MD_ECF__BMASK            0x01 ///< PCA Counter/Timer Overflow Interrupt Enable       
#define PCA0MD_ECF__SHIFT            0x00 ///< PCA Counter/Timer Overflow Interrupt Enable       
#define PCA0MD_ECF__OVF_INT_DISABLED 0x00 ///< Disable the CF interrupt.                         
#define PCA0MD_ECF__OVF_INT_ENABLED  0x01 ///< Enable a PCA Counter/Timer Overflow interrupt     
                                          ///< request when CF is set.                           
                                                                                                 
#define PCA0MD_CPS__FMASK            0x0E ///< PCA Counter/Timer Pulse Select                    
#define PCA0MD_CPS__SHIFT            0x01 ///< PCA Counter/Timer Pulse Select                    
#define PCA0MD_CPS__SYSCLK_DIV_12    0x00 ///< System clock divided by 12.                       
#define PCA0MD_CPS__SYSCLK_DIV_4     0x02 ///< System clock divided by 4.                        
#define PCA0MD_CPS__T0_OVERFLOW      0x04 ///< Timer 0 overflow.                                 
#define PCA0MD_CPS__ECI              0x06 ///< High-to-low transitions on ECI (max rate = system 
                                          ///< clock divided by 4).                              
#define PCA0MD_CPS__SYSCLK           0x08 ///< System clock.                                     
#define PCA0MD_CPS__EXTOSC_DIV_8     0x0A ///< External clock divided by 8 (synchronized with the
                                          ///< system clock).                                    
                                                                                                 
#define PCA0MD_CIDL__BMASK           0x80 ///< PCA Counter/Timer Idle Control                    
#define PCA0MD_CIDL__SHIFT           0x07 ///< PCA Counter/Timer Idle Control                    
#define PCA0MD_CIDL__NORMAL          0x00 ///< PCA continues to function normally while the      
                                          ///< system controller is in Idle Mode.                
#define PCA0MD_CIDL__SUSPEND         0x80 ///< PCA operation is suspended while the system       
                                          ///< controller is in Idle Mode.                       
                                                                                                 
//------------------------------------------------------------------------------
// PLL0CN Enums (PLL Control @ 0x89)
//------------------------------------------------------------------------------
#define PLL0CN_PLLPWR__BMASK      0x01 ///< Power Enable                                    
#define PLL0CN_PLLPWR__SHIFT      0x00 ///< Power Enable                                    
#define PLL0CN_PLLPWR__DISABLED   0x00 ///< Disable the PLL bias generator. The PLL does not
                                       ///< consume any static power.                       
#define PLL0CN_PLLPWR__ENABLED    0x01 ///< Enable the PLL bias generator.                  
                                                                                            
#define PLL0CN_PLLEN__BMASK       0x02 ///< PLL Enable                                      
#define PLL0CN_PLLEN__SHIFT       0x01 ///< PLL Enable                                      
#define PLL0CN_PLLEN__DISABLED    0x00 ///< PLL is held in reset.                           
#define PLL0CN_PLLEN__ENABLED     0x02 ///< PLL is enabled.                                 
                                                                                            
#define PLL0CN_PLLSRC__BMASK      0x04 ///< Reference Clock Source Select                   
#define PLL0CN_PLLSRC__SHIFT      0x02 ///< Reference Clock Source Select                   
#define PLL0CN_PLLSRC__HFOSC      0x00 ///< PLL reference clock source is the internal High-
                                       ///< Frequency Oscillator.                           
#define PLL0CN_PLLSRC__EXTOSC     0x04 ///< PLL reference clock source is the external      
                                       ///< oscillator.                                     
                                                                                            
#define PLL0CN_PLLLCK__BMASK      0x10 ///< Lock Flag                                       
#define PLL0CN_PLLLCK__SHIFT      0x04 ///< Lock Flag                                       
#define PLL0CN_PLLLCK__NOT_LOCKED 0x00 ///< PLL output frequency is not locked.             
#define PLL0CN_PLLLCK__LOCKED     0x10 ///< PLL output frequency is locked.                 
                                                                                            
//------------------------------------------------------------------------------
// PLL0DIV Enums (PLL Divider @ 0x8D)
//------------------------------------------------------------------------------
#define PLL0DIV_PLLM__FMASK 0x1F ///< PLL Reference Clock Divider
#define PLL0DIV_PLLM__SHIFT 0x00 ///< PLL Reference Clock Divider
                                                                 
//------------------------------------------------------------------------------
// PLL0FLT Enums (PLL Filter @ 0x8F)
//------------------------------------------------------------------------------
#define PLL0FLT_PLLLP__FMASK                      0x0F ///< PLL Loop Filter Control
#define PLL0FLT_PLLLP__SHIFT                      0x00 ///< PLL Loop Filter Control
#define PLL0FLT_PLLLP__DIV_INPUT_19_TO_30_MHZ     0x01 ///< 19-30 MHz.             
#define PLL0FLT_PLLLP__DIV_INPUT_12P2_TO_19P5_MHZ 0x03 ///< 12.2-19.5 MHz.         
#define PLL0FLT_PLLLP__DIV_INPUT_7P8_TO_12P5_MHZ  0x07 ///< 7.8-12.5 MHz.          
#define PLL0FLT_PLLLP__DIV_INPUT_5_TO_8_MHZ       0x0F ///< 5-8 MHz.               
                                                                                   
#define PLL0FLT_PLLICO__FMASK                     0x30 ///< PLL Output Range       
#define PLL0FLT_PLLICO__SHIFT                     0x04 ///< PLL Output Range       
#define PLL0FLT_PLLICO__OUTPUT_65_TO_100_MHZ      0x00 ///< 65-100 MHz.            
#define PLL0FLT_PLLICO__OUTPUT_45_TO_80_MHZ       0x10 ///< 45-80 MHz.             
#define PLL0FLT_PLLICO__OUTPUT_30_TO_60_MHZ       0x20 ///< 30-60 MHz.             
#define PLL0FLT_PLLICO__OUTPUT_25_TO_50_MHZ       0x30 ///< 25-50 MHz.             
                                                                                   
//------------------------------------------------------------------------------
// PLL0MUL Enums (PLL Multiplier @ 0x8E)
//------------------------------------------------------------------------------
#define PLL0MUL_PLLN__FMASK 0xFF ///< PLL Multiplier
#define PLL0MUL_PLLN__SHIFT 0x00 ///< PLL Multiplier
                                                    
//------------------------------------------------------------------------------
// PCON Enums (Power Control @ 0x87)
//------------------------------------------------------------------------------
#define PCON_IDLE__BMASK  0x01 ///< Idle Mode Select                                
#define PCON_IDLE__SHIFT  0x00 ///< Idle Mode Select                                
#define PCON_IDLE__NORMAL 0x00 ///< Idle mode not activated.                        
#define PCON_IDLE__IDLE   0x01 ///< CPU goes into Idle mode (shuts off clock to CPU,
                               ///< but clocks to enabled peripherals are still     
                               ///< active).                                        
                                                                                    
