ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define P5MDOUT_B4__BMASK      0x10 ///< Port 5 Bit 4 Output Mode  
#define P5MDOUT_B4__SHIFT      0x04 ///< Port 5 Bit 4 Output Mode  
#define P5MDOUT_B4__OPEN_DRAIN 0x00 ///< P5.4 output is open-drain.
#define P5MDOUT_B4__PUSH_PULL  0x10 ///< P5.4 output is push-pull. 
                                                                   
#define P5MDOUT_B5__BMASK      0x20 ///< Port 5 Bit 5 Output Mode  
#define P5MDOUT_B5__SHIFT      0x05 ///< Port 5 Bit 5 Output Mode  
#define P5MDOUT_B5__OPEN_DRAIN 0x00 ///< P5.5 output is open-drain.
#define P5MDOUT_B5__PUSH_PULL  0x20 ///< P5.5 output is push-pull. 
                                                                   
#define P5MDOUT_B6__BMASK      0x40 ///< Port 5 Bit 6 Output Mode  
#define P5MDOUT_B6__SHIFT      0x06 ///< Port 5 Bit 6 Output Mode  
#define P5MDOUT_B6__OPEN_DRAIN 0x00 ///< P5.6 output is open-drain.
#define P5MDOUT_B6__PUSH_PULL  0x40 ///< P5.6 output is push-pull. 
                                                                   
#define P5MDOUT_B7__BMASK      0x80 ///< Port 5 Bit 7 Output Mode  
#define P5MDOUT_B7__SHIFT      0x07 ///< Port 5 Bit 7 Output Mode  
#define P5MDOUT_B7__OPEN_DRAIN 0x00 ///< P5.7 output is open-drain.
#define P5MDOUT_B7__PUSH_PULL  0x80 ///< P5.7 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// P6 Enums (Port 6 Pin Latch @ 0xE8)
//------------------------------------------------------------------------------
#define P6_B0__BMASK 0x01 ///< Port 6 Bit 0 Latch                            
#define P6_B0__SHIFT 0x00 ///< Port 6 Bit 0 Latch                            
#define P6_B0__LOW   0x00 ///< P6.0 is low. Set P6.0 to drive low.           
#define P6_B0__HIGH  0x01 ///< P6.0 is high. Set P6.0 to drive or float high.
                                                                             
#define P6_B1__BMASK 0x02 ///< Port 6 Bit 1 Latch                            
#define P6_B1__SHIFT 0x01 ///< Port 6 Bit 1 Latch                            
#define P6_B1__LOW   0x00 ///< P6.1 is low. Set P6.1 to drive low.           
#define P6_B1__HIGH  0x02 ///< P6.1 is high. Set P6.1 to drive or float high.
                                                                             
#define P6_B2__BMASK 0x04 ///< Port 6 Bit 2 Latch                            
#define P6_B2__SHIFT 0x02 ///< Port 6 Bit 2 Latch                            
#define P6_B2__LOW   0x00 ///< P6.2 is low. Set P6.2 to drive low.           
#define P6_B2__HIGH  0x04 ///< P6.2 is high. Set P6.2 to drive or float high.
                                                                             
#define P6_B3__BMASK 0x08 ///< Port 6 Bit 3 Latch                            
#define P6_B3__SHIFT 0x03 ///< Port 6 Bit 3 Latch                            
#define P6_B3__LOW   0x00 ///< P6.3 is low. Set P6.3 to drive low.           
#define P6_B3__HIGH  0x08 ///< P6.3 is high. Set P6.3 to drive or float high.
                                                                             
#define P6_B4__BMASK 0x10 ///< Port 6 Bit 4 Latch                            
#define P6_B4__SHIFT 0x04 ///< Port 6 Bit 4 Latch                            
#define P6_B4__LOW   0x00 ///< P6.4 is low. Set P6.4 to drive low.           
#define P6_B4__HIGH  0x10 ///< P6.4 is high. Set P6.4 to drive or float high.
                                                                             
#define P6_B5__BMASK 0x20 ///< Port 6 Bit 5 Latch                            
#define P6_B5__SHIFT 0x05 ///< Port 6 Bit 5 Latch                            
#define P6_B5__LOW   0x00 ///< P6.5 is low. Set P6.5 to drive low.           
#define P6_B5__HIGH  0x20 ///< P6.5 is high. Set P6.5 to drive or float high.
                                                                             
#define P6_B6__BMASK 0x40 ///< Port 6 Bit 6 Latch                            
#define P6_B6__SHIFT 0x06 ///< Port 6 Bit 6 Latch                            
#define P6_B6__LOW   0x00 ///< P6.6 is low. Set P6.6 to drive low.           
#define P6_B6__HIGH  0x40 ///< P6.6 is high. Set P6.6 to drive or float high.
                                                                             
#define P6_B7__BMASK 0x80 ///< Port 6 Bit 7 Latch                            
#define P6_B7__SHIFT 0x07 ///< Port 6 Bit 7 Latch                            
#define P6_B7__LOW   0x00 ///< P6.7 is low. Set P6.7 to drive low.           
#define P6_B7__HIGH  0x80 ///< P6.7 is high. Set P6.7 to drive or float high.
                                                                             
//------------------------------------------------------------------------------
// P6MDOUT Enums (Port 6 Output Mode @ 0x9E)
//------------------------------------------------------------------------------
#define P6MDOUT_B0__BMASK      0x01 ///< Port 6 Bit 0 Output Mode  
#define P6MDOUT_B0__SHIFT      0x00 ///< Port 6 Bit 0 Output Mode  
#define P6MDOUT_B0__OPEN_DRAIN 0x00 ///< P6.0 output is open-drain.
#define P6MDOUT_B0__PUSH_PULL  0x01 ///< P6.0 output is push-pull. 
                                                                   
#define P6MDOUT_B1__BMASK      0x02 ///< Port 6 Bit 1 Output Mode  
#define P6MDOUT_B1__SHIFT      0x01 ///< Port 6 Bit 1 Output Mode  
#define P6MDOUT_B1__OPEN_DRAIN 0x00 ///< P6.1 output is open-drain.
#define P6MDOUT_B1__PUSH_PULL  0x02 ///< P6.1 output is push-pull. 
                                                                   
#define P6MDOUT_B2__BMASK      0x04 ///< Port 6 Bit 2 Output Mode  
#define P6MDOUT_B2__SHIFT      0x02 ///< Port 6 Bit 2 Output Mode  
#define P6MDOUT_B2__OPEN_DRAIN 0x00 ///< P6.2 output is open-drain.
#define P6MDOUT_B2__PUSH_PULL  0x04 ///< P6.2 output is push-pull. 
                                                                   
#define P6MDOUT_B3__BMASK      0x08 ///< Port 6 Bit 3 Output Mode  
#define P6MDOUT_B3__SHIFT      0x03 ///< Port 6 Bit 3 Output Mode  
#define P6MDOUT_B3__OPEN_DRAIN 0x00 ///< P6.3 output is open-drain.
#define P6MDOUT_B3__PUSH_PULL  0x08 ///< P6.3 output is push-pull. 
                                                                   
