ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define P6MDOUT_B4__BMASK      0x10 ///< Port 6 Bit 4 Output Mode  
#define P6MDOUT_B4__SHIFT      0x04 ///< Port 6 Bit 4 Output Mode  
#define P6MDOUT_B4__OPEN_DRAIN 0x00 ///< P6.4 output is open-drain.
#define P6MDOUT_B4__PUSH_PULL  0x10 ///< P6.4 output is push-pull. 
                                                                   
#define P6MDOUT_B5__BMASK      0x20 ///< Port 6 Bit 5 Output Mode  
#define P6MDOUT_B5__SHIFT      0x05 ///< Port 6 Bit 5 Output Mode  
#define P6MDOUT_B5__OPEN_DRAIN 0x00 ///< P6.5 output is open-drain.
#define P6MDOUT_B5__PUSH_PULL  0x20 ///< P6.5 output is push-pull. 
                                                                   
#define P6MDOUT_B6__BMASK      0x40 ///< Port 6 Bit 6 Output Mode  
#define P6MDOUT_B6__SHIFT      0x06 ///< Port 6 Bit 6 Output Mode  
#define P6MDOUT_B6__OPEN_DRAIN 0x00 ///< P6.6 output is open-drain.
#define P6MDOUT_B6__PUSH_PULL  0x40 ///< P6.6 output is push-pull. 
                                                                   
#define P6MDOUT_B7__BMASK      0x80 ///< Port 6 Bit 7 Output Mode  
#define P6MDOUT_B7__SHIFT      0x07 ///< Port 6 Bit 7 Output Mode  
#define P6MDOUT_B7__OPEN_DRAIN 0x00 ///< P6.7 output is open-drain.
#define P6MDOUT_B7__PUSH_PULL  0x80 ///< P6.7 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// P7 Enums (Port 7 Pin Latch @ 0xF8)
//------------------------------------------------------------------------------
#define P7_B0__BMASK 0x01 ///< Port 7 Bit 0 Latch                            
#define P7_B0__SHIFT 0x00 ///< Port 7 Bit 0 Latch                            
#define P7_B0__LOW   0x00 ///< P7.0 is low. Set P7.0 to drive low.           
#define P7_B0__HIGH  0x01 ///< P7.0 is high. Set P7.0 to drive or float high.
                                                                             
#define P7_B1__BMASK 0x02 ///< Port 7 Bit 1 Latch                            
#define P7_B1__SHIFT 0x01 ///< Port 7 Bit 1 Latch                            
#define P7_B1__LOW   0x00 ///< P7.1 is low. Set P7.1 to drive low.           
#define P7_B1__HIGH  0x02 ///< P7.1 is high. Set P7.1 to drive or float high.
                                                                             
#define P7_B2__BMASK 0x04 ///< Port 7 Bit 2 Latch                            
#define P7_B2__SHIFT 0x02 ///< Port 7 Bit 2 Latch                            
#define P7_B2__LOW   0x00 ///< P7.2 is low. Set P7.2 to drive low.           
#define P7_B2__HIGH  0x04 ///< P7.2 is high. Set P7.2 to drive or float high.
                                                                             
#define P7_B3__BMASK 0x08 ///< Port 7 Bit 3 Latch                            
#define P7_B3__SHIFT 0x03 ///< Port 7 Bit 3 Latch                            
#define P7_B3__LOW   0x00 ///< P7.3 is low. Set P7.3 to drive low.           
#define P7_B3__HIGH  0x08 ///< P7.3 is high. Set P7.3 to drive or float high.
                                                                             
#define P7_B4__BMASK 0x10 ///< Port 7 Bit 4 Latch                            
#define P7_B4__SHIFT 0x04 ///< Port 7 Bit 4 Latch                            
#define P7_B4__LOW   0x00 ///< P7.4 is low. Set P7.4 to drive low.           
#define P7_B4__HIGH  0x10 ///< P7.4 is high. Set P7.4 to drive or float high.
                                                                             
#define P7_B5__BMASK 0x20 ///< Port 7 Bit 5 Latch                            
#define P7_B5__SHIFT 0x05 ///< Port 7 Bit 5 Latch                            
#define P7_B5__LOW   0x00 ///< P7.5 is low. Set P7.5 to drive low.           
#define P7_B5__HIGH  0x20 ///< P7.5 is high. Set P7.5 to drive or float high.
                                                                             
#define P7_B6__BMASK 0x40 ///< Port 7 Bit 6 Latch                            
#define P7_B6__SHIFT 0x06 ///< Port 7 Bit 6 Latch                            
#define P7_B6__LOW   0x00 ///< P7.6 is low. Set P7.6 to drive low.           
#define P7_B6__HIGH  0x40 ///< P7.6 is high. Set P7.6 to drive or float high.
                                                                             
#define P7_B7__BMASK 0x80 ///< Port 7 Bit 7 Latch                            
#define P7_B7__SHIFT 0x07 ///< Port 7 Bit 7 Latch                            
#define P7_B7__LOW   0x00 ///< P7.7 is low. Set P7.7 to drive low.           
#define P7_B7__HIGH  0x80 ///< P7.7 is high. Set P7.7 to drive or float high.
                                                                             
//------------------------------------------------------------------------------
// P7MDOUT Enums (Port 7 Output Mode @ 0x9F)
//------------------------------------------------------------------------------
#define P7MDOUT_B0__BMASK      0x01 ///< Port 7 Bit 0 Output Mode  
#define P7MDOUT_B0__SHIFT      0x00 ///< Port 7 Bit 0 Output Mode  
#define P7MDOUT_B0__OPEN_DRAIN 0x00 ///< P7.0 output is open-drain.
#define P7MDOUT_B0__PUSH_PULL  0x01 ///< P7.0 output is push-pull. 
                                                                   
#define P7MDOUT_B1__BMASK      0x02 ///< Port 7 Bit 1 Output Mode  
#define P7MDOUT_B1__SHIFT      0x01 ///< Port 7 Bit 1 Output Mode  
#define P7MDOUT_B1__OPEN_DRAIN 0x00 ///< P7.1 output is open-drain.
#define P7MDOUT_B1__PUSH_PULL  0x02 ///< P7.1 output is push-pull. 
                                                                   
#define P7MDOUT_B2__BMASK      0x04 ///< Port 7 Bit 2 Output Mode  
#define P7MDOUT_B2__SHIFT      0x02 ///< Port 7 Bit 2 Output Mode  
#define P7MDOUT_B2__OPEN_DRAIN 0x00 ///< P7.2 output is open-drain.
#define P7MDOUT_B2__PUSH_PULL  0x04 ///< P7.2 output is push-pull. 
                                                                   
#define P7MDOUT_B3__BMASK      0x08 ///< Port 7 Bit 3 Output Mode  
#define P7MDOUT_B3__SHIFT      0x03 ///< Port 7 Bit 3 Output Mode  
#define P7MDOUT_B3__OPEN_DRAIN 0x00 ///< P7.3 output is open-drain.
#define P7MDOUT_B3__PUSH_PULL  0x08 ///< P7.3 output is push-pull. 
                                                                   
#define P7MDOUT_B4__BMASK      0x10 ///< Port 7 Bit 4 Output Mode  
#define P7MDOUT_B4__SHIFT      0x04 ///< Port 7 Bit 4 Output Mode  
#define P7MDOUT_B4__OPEN_DRAIN 0x00 ///< P7.4 output is open-drain.
#define P7MDOUT_B4__PUSH_PULL  0x10 ///< P7.4 output is push-pull. 
                                                                   
#define P7MDOUT_B5__BMASK      0x20 ///< Port 7 Bit 5 Output Mode  
#define P7MDOUT_B5__SHIFT      0x05 ///< Port 7 Bit 5 Output Mode  
#define P7MDOUT_B5__OPEN_DRAIN 0x00 ///< P7.5 output is open-drain.
#define P7MDOUT_B5__PUSH_PULL  0x20 ///< P7.5 output is push-pull. 
                                                                   
