ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define P7MDOUT_B6__BMASK      0x40 ///< Port 7 Bit 6 Output Mode  
#define P7MDOUT_B6__SHIFT      0x06 ///< Port 7 Bit 6 Output Mode  
#define P7MDOUT_B6__OPEN_DRAIN 0x00 ///< P7.6 output is open-drain.
#define P7MDOUT_B6__PUSH_PULL  0x40 ///< P7.6 output is push-pull. 
                                                                   
#define P7MDOUT_B7__BMASK      0x80 ///< Port 7 Bit 7 Output Mode  
#define P7MDOUT_B7__SHIFT      0x07 ///< Port 7 Bit 7 Output Mode  
#define P7MDOUT_B7__OPEN_DRAIN 0x00 ///< P7.7 output is open-drain.
#define P7MDOUT_B7__PUSH_PULL  0x80 ///< P7.7 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// RSTSRC Enums (Reset Source @ 0xEF)
//------------------------------------------------------------------------------
#define RSTSRC_PINRSF__BMASK    0x01 ///< HW Pin Reset Flag                                                    
#define RSTSRC_PINRSF__SHIFT    0x00 ///< HW Pin Reset Flag                                                    
#define RSTSRC_PINRSF__NOT_SET  0x00 ///< The /RST pin did not cause the last reset.                           
#define RSTSRC_PINRSF__SET      0x01 ///< The /RST pin caused the last reset.                                  
                                                                                                               
#define RSTSRC_PORSF__BMASK     0x02 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__SHIFT     0x01 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__NOT_SET   0x00 ///< A power-on or supply monitor reset did not occur.                    
#define RSTSRC_PORSF__SET       0x02 ///< A power-on or supply monitor reset occurred.                         
                                                                                                               
#define RSTSRC_MCDRSF__BMASK    0x04 ///< Missing Clock Detector Enable and Flag                               
#define RSTSRC_MCDRSF__SHIFT    0x02 ///< Missing Clock Detector Enable and Flag                               
#define RSTSRC_MCDRSF__NOT_SET  0x00 ///< A missing clock detector reset did not occur.                        
#define RSTSRC_MCDRSF__SET      0x04 ///< A missing clock detector reset occurred.                             
                                                                                                               
#define RSTSRC_WDTRSF__BMASK    0x08 ///< Watchdog Timer Reset Flag                                            
#define RSTSRC_WDTRSF__SHIFT    0x03 ///< Watchdog Timer Reset Flag                                            
#define RSTSRC_WDTRSF__NOT_SET  0x00 ///< A watchdog timer overflow reset did not occur.                       
#define RSTSRC_WDTRSF__SET      0x08 ///< A watchdog timer overflow reset occurred.                            
                                                                                                               
#define RSTSRC_SWRSF__BMASK     0x10 ///< Software Reset Force and Flag                                        
#define RSTSRC_SWRSF__SHIFT     0x04 ///< Software Reset Force and Flag                                        
#define RSTSRC_SWRSF__NOT_SET   0x00 ///< A software reset did not occur.                                      
#define RSTSRC_SWRSF__SET       0x10 ///< A software reset occurred.                                           
                                                                                                               
#define RSTSRC_C0RSEF__BMASK    0x20 ///< Comparator0 Reset Enable and Flag                                    
#define RSTSRC_C0RSEF__SHIFT    0x05 ///< Comparator0 Reset Enable and Flag                                    
#define RSTSRC_C0RSEF__NOT_SET  0x00 ///< A Comparator 0 reset did not occur.                                  
#define RSTSRC_C0RSEF__SET      0x20 ///< A Comparator 0 reset occurred.                                       
                                                                                                               
#define RSTSRC_CNVRSEF__BMASK   0x40 ///< Convert Start 0 Reset Source Enable and Flag                         
#define RSTSRC_CNVRSEF__SHIFT   0x06 ///< Convert Start 0 Reset Source Enable and Flag                         
#define RSTSRC_CNVRSEF__NOT_SET 0x00 ///< A CNVSTR0 reset did not occur.                                       
#define RSTSRC_CNVRSEF__SET     0x40 ///< A CNVSTR0 reset occurred.                                            
                                                                                                               
#define RSTSRC_RTC0RE__BMASK    0x80 ///< RTC Reset Enable and Flag                                            
#define RSTSRC_RTC0RE__SHIFT    0x07 ///< RTC Reset Enable and Flag                                            
#define RSTSRC_RTC0RE__NOT_SET  0x00 ///< A RTC alarm or oscillator fail reset did not                         
                                     ///< occur.                                                               
#define RSTSRC_RTC0RE__SET      0x80 ///< A RTC alarm or oscillator fail reset occurred.                       
                                                                                                               
//------------------------------------------------------------------------------
// SFRLAST Enums (SFR Page Last @ 0x86)
//------------------------------------------------------------------------------
#define SFRLAST_SFRLAST__FMASK 0xFF ///< SFR Page Last
#define SFRLAST_SFRLAST__SHIFT 0x00 ///< SFR Page Last
                                                      
//------------------------------------------------------------------------------
// SFRNEXT Enums (SFR Page Next @ 0x85)
//------------------------------------------------------------------------------
#define SFRNEXT_SFRNEXT__FMASK 0xFF ///< SFR Page Next
#define SFRNEXT_SFRNEXT__SHIFT 0x00 ///< SFR Page Next
                                                      
//------------------------------------------------------------------------------
// SFRPAGE Enums (SFR Page @ 0x84)
//------------------------------------------------------------------------------
#define SFRPAGE_SFRPAGE__FMASK 0xFF ///< SFR Page
#define SFRPAGE_SFRPAGE__SHIFT 0x00 ///< SFR Page
                                                 
//------------------------------------------------------------------------------
// SFRPGCN Enums (SFR Page Control @ 0x96)
//------------------------------------------------------------------------------
#define SFRPGCN_SFRPGEN__BMASK    0x01 ///< SFR Automatic Page Control Enable
#define SFRPGCN_SFRPGEN__SHIFT    0x00 ///< SFR Automatic Page Control Enable
#define SFRPGCN_SFRPGEN__DISABLED 0x00 ///< Disable automatic SFR paging.    
#define SFRPGCN_SFRPGEN__ENABLED  0x01 ///< Enable automatic SFR paging.     
                                                                             
//------------------------------------------------------------------------------
// SMB0ADR Enums (SMBus 0 Address @ 0xC3)
//------------------------------------------------------------------------------
#define SMB0ADR_GC__BMASK      0x01 ///< General Call Address Enable        
#define SMB0ADR_GC__SHIFT      0x00 ///< General Call Address Enable        
#define SMB0ADR_GC__IGNORED    0x00 ///< General Call Address is ignored.   
#define SMB0ADR_GC__RECOGNIZED 0x01 ///< General Call Address is recognized.
                                                                            
#define SMB0ADR_SLV__FMASK     0xFE ///< SMBus Slave Address                
#define SMB0ADR_SLV__SHIFT     0x01 ///< SMBus Slave Address                
                                                                            
//------------------------------------------------------------------------------
// SMB0CN Enums (SMBus 0 Control @ 0xC0)
//------------------------------------------------------------------------------
#define SMB0CN_TOE__BMASK            0x01 ///< SMBus Timeout Enable                              
#define SMB0CN_TOE__SHIFT            0x00 ///< SMBus Timeout Enable                              
#define SMB0CN_TOE__SCL_TO_DISABLED  0x00 ///< No timeout when SCL is low.                       
#define SMB0CN_TOE__SCL_TO_ENABLED   0x01 ///< Timeout when SCL low time exceeds limit specified 
                                          ///< by Timer 3, if enabled.                           
                                                                                                 
#define SMB0CN_FTE__BMASK            0x02 ///< SMBus Free Timer Enable                           
#define SMB0CN_FTE__SHIFT            0x01 ///< SMBus Free Timer Enable                           
#define SMB0CN_FTE__FREE_TO_DISABLED 0x00 ///< No timeout when SCL is high.                      
#define SMB0CN_FTE__FREE_TO_ENABLED  0x02 ///< Timeout when SCL high time exceeds limit specified
                                          ///< by the SMBCR value.                               
                                                                                                 
