ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define SMB0CN_AA__BMASK             0x04 ///< SMBus Assert Acknowledge Flag                     
#define SMB0CN_AA__SHIFT             0x02 ///< SMBus Assert Acknowledge Flag                     
#define SMB0CN_AA__NOT_SET           0x00 ///< A "not acknowledge" (high level on SDA) is        
                                          ///< returned during the acknowledge cycle.            
#define SMB0CN_AA__SET               0x04 ///< An "acknowledge" (low level on SDA) is returned   
                                          ///< during the acknowledge cycle.                     
                                                                                                 
#define SMB0CN_SI__BMASK             0x08 ///< SMBus Acknowledge Request                         
#define SMB0CN_SI__SHIFT             0x03 ///< SMBus Acknowledge Request                         
#define SMB0CN_SI__NOT_SET           0x00 ///< An SMBus interrupt did not occur.                 
#define SMB0CN_SI__SET               0x08 ///< An SMBus interrupt occurred.                      
                                                                                                 
#define SMB0CN_STO__BMASK            0x10 ///< SMBus Stop Flag                                   
#define SMB0CN_STO__SHIFT            0x04 ///< SMBus Stop Flag                                   
#define SMB0CN_STO__NOT_SET          0x00 ///< No STOP condition is transmitted.                 
#define SMB0CN_STO__SET              0x10 ///< Setting STO to logic 1 causes a STOP condition to 
                                          ///< be transmitted.                                   
                                                                                                 
#define SMB0CN_STA__BMASK            0x20 ///< SMBus Start Flag                                  
#define SMB0CN_STA__SHIFT            0x05 ///< SMBus Start Flag                                  
#define SMB0CN_STA__NOT_SET          0x00 ///< No START condition is transmitted.                
#define SMB0CN_STA__SET              0x20 ///< When operating as a master, a START condition is  
                                          ///< transmitted if the bus is free. (If the bus is not
                                          ///< free, the START is transmitted after a STOP is    
                                          ///< received.)                                        
                                                                                                 
#define SMB0CN_ENSMB__BMASK          0x40 ///< SMBus Enable                                      
#define SMB0CN_ENSMB__SHIFT          0x06 ///< SMBus Enable                                      
#define SMB0CN_ENSMB__DISABLED       0x00 ///< SMBus 0 disabled.                                 
#define SMB0CN_ENSMB__ENABLED        0x40 ///< SMBus 0 enabled.                                  
                                                                                                 
#define SMB0CN_BUSY__BMASK           0x80 ///< Busy Status Flag                                  
#define SMB0CN_BUSY__SHIFT           0x07 ///< Busy Status Flag                                  
#define SMB0CN_BUSY__NOT_SET         0x00 ///< SMBus 0 is free.                                  
#define SMB0CN_BUSY__SET             0x80 ///< SMBus 0 is busy.                                  
                                                                                                 
//------------------------------------------------------------------------------
// SMB0CR Enums (SMBus 0 Clock Rate @ 0xCF)
//------------------------------------------------------------------------------
#define SMB0CR_SMBCR__FMASK 0xFF ///< SMBus0 Clock Rate Preset
#define SMB0CR_SMBCR__SHIFT 0x00 ///< SMBus0 Clock Rate Preset
                                                              
//------------------------------------------------------------------------------
// SMB0DAT Enums (SMBus 0 Data @ 0xC2)
//------------------------------------------------------------------------------
#define SMB0DAT_SMB0DAT__FMASK 0xFF ///< SMBus 0 Data
#define SMB0DAT_SMB0DAT__SHIFT 0x00 ///< SMBus 0 Data
                                                     
//------------------------------------------------------------------------------
// SMB0STA Enums (SMBus 0 Status @ 0xC1)
//------------------------------------------------------------------------------
#define SMB0STA_STA__FMASK 0xFF ///< SMBus 0 Status
#define SMB0STA_STA__SHIFT 0x00 ///< SMBus 0 Status
                                                   
//------------------------------------------------------------------------------
// SPI0CFG Enums (SPI0 Configuration @ 0x9A)
//------------------------------------------------------------------------------
#define SPI0CFG_RXBMT__BMASK                0x01 ///< Receive Buffer Empty                              
#define SPI0CFG_RXBMT__SHIFT                0x00 ///< Receive Buffer Empty                              
#define SPI0CFG_RXBMT__NOT_SET              0x00 ///< New data is available in the receive buffer (Slave
                                                 ///< mode).                                            
#define SPI0CFG_RXBMT__SET                  0x01 ///< No new data in the receive buffer (Slave mode).   
                                                                                                        
#define SPI0CFG_SRMT__BMASK                 0x02 ///< Shift Register Empty                              
#define SPI0CFG_SRMT__SHIFT                 0x01 ///< Shift Register Empty                              
#define SPI0CFG_SRMT__NOT_SET               0x00 ///< The shift register is not empty.                  
#define SPI0CFG_SRMT__SET                   0x02 ///< The shift register is empty.                      
                                                                                                        
