ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define SPI0CFG_NSSIN__BMASK                0x04 ///< NSS Instantaneous Pin Input                       
#define SPI0CFG_NSSIN__SHIFT                0x02 ///< NSS Instantaneous Pin Input                       
#define SPI0CFG_NSSIN__LOW                  0x00 ///< The NSS pin is low.                               
#define SPI0CFG_NSSIN__HIGH                 0x04 ///< The NSS pin is high.                              
                                                                                                        
#define SPI0CFG_SLVSEL__BMASK               0x08 ///< Slave Selected Flag                               
#define SPI0CFG_SLVSEL__SHIFT               0x03 ///< Slave Selected Flag                               
#define SPI0CFG_SLVSEL__NOT_SELECTED        0x00 ///< The Slave is not selected (NSS is high).          
#define SPI0CFG_SLVSEL__SELECTED            0x08 ///< The Slave is selected (NSS is low).               
                                                                                                        
#define SPI0CFG_CKPOL__BMASK                0x10 ///< SPI0 Clock Polarity                               
#define SPI0CFG_CKPOL__SHIFT                0x04 ///< SPI0 Clock Polarity                               
#define SPI0CFG_CKPOL__IDLE_LOW             0x00 ///< SCK line low in idle state.                       
#define SPI0CFG_CKPOL__IDLE_HIGH            0x10 ///< SCK line high in idle state.                      
                                                                                                        
#define SPI0CFG_CKPHA__BMASK                0x20 ///< SPI0 Clock Phase                                  
#define SPI0CFG_CKPHA__SHIFT                0x05 ///< SPI0 Clock Phase                                  
#define SPI0CFG_CKPHA__DATA_CENTERED_FIRST  0x00 ///< Data centered on first edge of SCK period.        
#define SPI0CFG_CKPHA__DATA_CENTERED_SECOND 0x20 ///< Data centered on second edge of SCK period.       
                                                                                                        
#define SPI0CFG_MSTEN__BMASK                0x40 ///< Master Mode Enable                                
#define SPI0CFG_MSTEN__SHIFT                0x06 ///< Master Mode Enable                                
#define SPI0CFG_MSTEN__MASTER_DISABLED      0x00 ///< Disable master mode. Operate in slave mode.       
#define SPI0CFG_MSTEN__MASTER_ENABLED       0x40 ///< Enable master mode. Operate as a master.          
                                                                                                        
#define SPI0CFG_SPIBSY__BMASK               0x80 ///< SPI Busy                                          
#define SPI0CFG_SPIBSY__SHIFT               0x07 ///< SPI Busy                                          
#define SPI0CFG_SPIBSY__NOT_SET             0x00 ///< A SPI transfer is not in progress.                
#define SPI0CFG_SPIBSY__SET                 0x80 ///< A SPI transfer is in progress.                    
                                                                                                        
//------------------------------------------------------------------------------
// SPI0CKR Enums (SPI0 Clock Rate @ 0x9D)
//------------------------------------------------------------------------------
#define SPI0CKR_SPI0CKR__FMASK 0xFF ///< SPI0 Clock Rate
#define SPI0CKR_SPI0CKR__SHIFT 0x00 ///< SPI0 Clock Rate
                                                        
//------------------------------------------------------------------------------
// SPI0CN Enums (SPI0 Control @ 0xF8)
//------------------------------------------------------------------------------
#define SPI0CN_SPIEN__BMASK                  0x01 ///< SPI0 Enable                                       
#define SPI0CN_SPIEN__SHIFT                  0x00 ///< SPI0 Enable                                       
#define SPI0CN_SPIEN__DISABLED               0x00 ///< Disable the SPI module.                           
#define SPI0CN_SPIEN__ENABLED                0x01 ///< Enable the SPI module.                            
                                                                                                         
#define SPI0CN_TXBMT__BMASK                  0x02 ///< Transmit Buffer Empty                             
#define SPI0CN_TXBMT__SHIFT                  0x01 ///< Transmit Buffer Empty                             
#define SPI0CN_TXBMT__NOT_SET                0x00 ///< The transmit buffer is not empty.                 
#define SPI0CN_TXBMT__SET                    0x02 ///< The transmit buffer is empty.                     
                                                                                                         
#define SPI0CN_NSSMD__FMASK                  0x0C ///< Slave Select Mode                                 
#define SPI0CN_NSSMD__SHIFT                  0x02 ///< Slave Select Mode                                 
#define SPI0CN_NSSMD__3_WIRE                 0x00 ///< 3-Wire Slave or 3-Wire Master Mode. NSS signal is 
                                                  ///< not routed to a port pin.                         
#define SPI0CN_NSSMD__4_WIRE_SLAVE           0x04 ///< 4-Wire Slave or Multi-Master Mode. NSS is an input
                                                  ///< to the device.                                    
#define SPI0CN_NSSMD__4_WIRE_MASTER_NSS_LOW  0x08 ///< 4-Wire Single-Master Mode. NSS is an output and   
                                                  ///< logic low.                                        
#define SPI0CN_NSSMD__4_WIRE_MASTER_NSS_HIGH 0x0C ///< 4-Wire Single-Master Mode. NSS is an output and   
                                                  ///< logic high.                                       
                                                                                                         
#define SPI0CN_RXOVRN__BMASK                 0x10 ///< Receive Overrun Flag                              
#define SPI0CN_RXOVRN__SHIFT                 0x04 ///< Receive Overrun Flag                              
#define SPI0CN_RXOVRN__NOT_SET               0x00 ///< A receive overrun did not occur.                  
#define SPI0CN_RXOVRN__SET                   0x10 ///< A receive overrun occurred.                       
                                                                                                         
#define SPI0CN_MODF__BMASK                   0x20 ///< Mode Fault Flag                                   
#define SPI0CN_MODF__SHIFT                   0x05 ///< Mode Fault Flag                                   
#define SPI0CN_MODF__NOT_SET                 0x00 ///< A master collision did not occur.                 
#define SPI0CN_MODF__SET                     0x20 ///< A master collision occurred.                      
                                                                                                         
#define SPI0CN_WCOL__BMASK                   0x40 ///< Write Collision Flag                              
#define SPI0CN_WCOL__SHIFT                   0x06 ///< Write Collision Flag                              
#define SPI0CN_WCOL__NOT_SET                 0x00 ///< A write collision did not occur.                  
#define SPI0CN_WCOL__SET                     0x40 ///< A write collision occurred.                       
                                                                                                         
#define SPI0CN_SPIF__BMASK                   0x80 ///< SPI0 Interrupt Flag                               
#define SPI0CN_SPIF__SHIFT                   0x07 ///< SPI0 Interrupt Flag                               
#define SPI0CN_SPIF__NOT_SET                 0x00 ///< A data transfer has not completed since the last  
                                                  ///< time SPIF was cleared.                            
#define SPI0CN_SPIF__SET                     0x80 ///< A data transfer completed.                        
                                                                                                         
//------------------------------------------------------------------------------
// SPI0DAT Enums (SPI0 Data @ 0x9B)
//------------------------------------------------------------------------------
#define SPI0DAT_SPI0DAT__FMASK 0xFF ///< SPI0 Transmit and Receive Data
#define SPI0DAT_SPI0DAT__SHIFT 0x00 ///< SPI0 Transmit and Receive Data
                                                                       
//------------------------------------------------------------------------------
// TH0 Enums (Timer 0 High Byte @ 0x8C)
//------------------------------------------------------------------------------
#define TH0_TH0__FMASK 0xFF ///< Timer 0 High Byte
#define TH0_TH0__SHIFT 0x00 ///< Timer 0 High Byte
                                                  
//------------------------------------------------------------------------------
// TH1 Enums (Timer 1 High Byte @ 0x8D)
//------------------------------------------------------------------------------
#define TH1_TH1__FMASK 0xFF ///< Timer 1 High Byte
#define TH1_TH1__SHIFT 0x00 ///< Timer 1 High Byte
                                                  
//------------------------------------------------------------------------------
// TL0 Enums (Timer 0 Low Byte @ 0x8A)
//------------------------------------------------------------------------------
#define TL0_TL0__FMASK 0xFF ///< Timer 0 Low Byte
#define TL0_TL0__SHIFT 0x00 ///< Timer 0 Low Byte
                                                 
//------------------------------------------------------------------------------
// TL1 Enums (Timer 1 Low Byte @ 0x8B)
//------------------------------------------------------------------------------
#define TL1_TL1__FMASK 0xFF ///< Timer 1 Low Byte
#define TL1_TL1__SHIFT 0x00 ///< Timer 1 Low Byte
                                                 
//------------------------------------------------------------------------------
// RCAP2H Enums (Timer 2 Capture Register High Byte @ 0xCB)
//------------------------------------------------------------------------------
#define RCAP2H_RCAP2L__FMASK 0xFF ///< Timer 2 Capture Register High Byte
#define RCAP2H_RCAP2L__SHIFT 0x00 ///< Timer 2 Capture Register High Byte
                                                                         
//------------------------------------------------------------------------------
// RCAP2L Enums (Timer 2 Capture Register Low Byte @ 0xCA)
//------------------------------------------------------------------------------
#define RCAP2L_RCAP2L__FMASK 0xFF ///< Timer 2 Capture Register Low Byte
#define RCAP2L_RCAP2L__SHIFT 0x00 ///< Timer 2 Capture Register Low Byte
                                                                        
//------------------------------------------------------------------------------
// TMR2CF Enums (Timer 2 Configuration @ 0xC9)
//------------------------------------------------------------------------------
#define TMR2CF_DCEN2__BMASK          0x01 ///< Decrement Enable                                  
#define TMR2CF_DCEN2__SHIFT          0x00 ///< Decrement Enable                                  
#define TMR2CF_DCEN2__DISABLED       0x00 ///< Timer will count up, regardless of the state of   
                                          ///< T2EX.                                             
#define TMR2CF_DCEN2__ENABLED        0x01 ///< Timer will count up or down depending on the state
                                          ///< of T2EX as follows: if T2EX = 0, the timer counts 
                                          ///< DOWN; if T2EX = 1, the timer counts UP.           
                                                                                                 
#define TMR2CF_T2OE__BMASK           0x02 ///< Timer Output Enable                               
#define TMR2CF_T2OE__SHIFT           0x01 ///< Timer Output Enable                               
#define TMR2CF_T2OE__OUTPUT_DISABLED 0x00 ///< Output of toggle mode not available at Timer's    
                                          ///< assigned port pin.                                
#define TMR2CF_T2OE__OUTPUT_ENABLED  0x02 ///< Output of toggle mode available at Timer's        
                                          ///< assigned port pin.                                
                                                                                                 
#define TMR2CF_TOG2__BMASK           0x04 ///< Toggle Output State                               
#define TMR2CF_TOG2__SHIFT           0x02 ///< Toggle Output State                               
#define TMR2CF_TOG2__NOT_SET         0x00 ///< Timer output is low. Set the timer output low.    
#define TMR2CF_TOG2__SET             0x04 ///< Timer output is high. Set the timer output high.  
                                                                                                 
#define TMR2CF_T2M__FMASK            0x18 ///< Timer Clock Mode Select                           
#define TMR2CF_T2M__SHIFT            0x03 ///< Timer Clock Mode Select                           
#define TMR2CF_T2M__SYSCLK_DIV_12    0x00 ///< System clock divided by 12.                       
#define TMR2CF_T2M__SYSCLK           0x08 ///< System clock.                                     
#define TMR2CF_T2M__EXTOSC_DIV_8     0x10 ///< External oscillator divided by 8 (synchronized    
                                          ///< with the system clock).                           
#define TMR2CF_T2M__SYSCLK_DIV_2     0x18 ///< System clock divided by 2.                        
                                                                                                 
//------------------------------------------------------------------------------
// TMR2CN Enums (Timer 2 Control @ 0xC8)
//------------------------------------------------------------------------------
#define TMR2CN_CPRL2__BMASK       0x01 ///< Capture/Reload Select                             
#define TMR2CN_CPRL2__SHIFT       0x00 ///< Capture/Reload Select                             
#define TMR2CN_CPRL2__AUTO_RELOAD 0x00 ///< Timer is in Auto-Reload Mode.                     
#define TMR2CN_CPRL2__CAPTURE     0x01 ///< Timer is in Capture Mode.                         
                                                                                              
#define TMR2CN_CT2__BMASK         0x02 ///< Counter/Timer Select                              
#define TMR2CN_CT2__SHIFT         0x01 ///< Counter/Timer Select                              
#define TMR2CN_CT2__TIMER         0x00 ///< Timer Function: Timer incremented by clock defined
                                       ///< by T2M.                                           
#define TMR2CN_CT2__COUNTER       0x02 ///< Counter Function: Timer incremented by high-to-low
                                       ///< transitions on external input pin.                
                                                                                              
