ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define TMR2CN_TR2__BMASK         0x04 ///< Timer 2 Run Control                               
#define TMR2CN_TR2__SHIFT         0x02 ///< Timer 2 Run Control                               
#define TMR2CN_TR2__STOP          0x00 ///< Stop Timer 2.                                     
#define TMR2CN_TR2__RUN           0x04 ///< Start Timer 2 running.                            
                                                                                              
#define TMR2CN_EXEN2__BMASK       0x08 ///< Timer 2 External Enable                           
#define TMR2CN_EXEN2__SHIFT       0x03 ///< Timer 2 External Enable                           
#define TMR2CN_EXEN2__DISABLED    0x00 ///< Transitions on the T2EX pin are ignored.          
#define TMR2CN_EXEN2__ENABLED     0x08 ///< Transitions on the T2EX pin cause capture, reload,
                                       ///< or control the direction of timer count (up or    
                                       ///< down).                                            
                                                                                              
#define TMR2CN_EXF2__BMASK        0x40 ///< Timer 2 External Flag                             
#define TMR2CN_EXF2__SHIFT        0x06 ///< Timer 2 External Flag                             
#define TMR2CN_EXF2__NOT_SET      0x00 ///< Timer 2 capture or reload did not occur.          
#define TMR2CN_EXF2__SET          0x40 ///< Timer 2 capture or reload occurred.               
                                                                                              
#define TMR2CN_TF2__BMASK         0x80 ///< Timer 2 Overflow/Underflow Flag                   
#define TMR2CN_TF2__SHIFT         0x07 ///< Timer 2 Overflow/Underflow Flag                   
#define TMR2CN_TF2__NOT_SET       0x00 ///< Timer 2 did not overflow or underflow.            
#define TMR2CN_TF2__SET           0x80 ///< Timer 2 overflowed or underflowed.                
                                                                                              
//------------------------------------------------------------------------------
// TMR2H Enums (Timer 2 High Byte @ 0xCD)
//------------------------------------------------------------------------------
#define TMR2H_TMR2H__FMASK 0xFF ///< Timer 2 High Byte
#define TMR2H_TMR2H__SHIFT 0x00 ///< Timer 2 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR2L Enums (Timer 2 Low Byte @ 0xCC)
//------------------------------------------------------------------------------
#define TMR2L_TMR2L__FMASK 0xFF ///< Timer 2 Low Byte
#define TMR2L_TMR2L__SHIFT 0x00 ///< Timer 2 Low Byte
                                                     
//------------------------------------------------------------------------------
// RCAP3H Enums (Timer 3 Capture Register High Byte @ 0xCB)
//------------------------------------------------------------------------------
#define RCAP3H_RCAP3L__FMASK 0xFF ///< Timer 3 Capture Register High Byte
#define RCAP3H_RCAP3L__SHIFT 0x00 ///< Timer 3 Capture Register High Byte
                                                                         
//------------------------------------------------------------------------------
// RCAP3L Enums (Timer 3 Capture Register Low Byte @ 0xCA)
//------------------------------------------------------------------------------
#define RCAP3L_RCAP3L__FMASK 0xFF ///< Timer 3 Capture Register Low Byte
#define RCAP3L_RCAP3L__SHIFT 0x00 ///< Timer 3 Capture Register Low Byte
                                                                        
//------------------------------------------------------------------------------
// TMR3CF Enums (Timer 3 Configuration @ 0xC9)
//------------------------------------------------------------------------------
#define TMR3CF_DCEN3__BMASK          0x01 ///< Decrement Enable                                  
#define TMR3CF_DCEN3__SHIFT          0x00 ///< Decrement Enable                                  
#define TMR3CF_DCEN3__DISABLED       0x00 ///< Timer will count up, regardless of the state of   
                                          ///< T3EX.                                             
#define TMR3CF_DCEN3__ENABLED        0x01 ///< Timer will count up or down depending on the state
                                          ///< of T3EX as follows: if T3EX = 0, the timer counts 
                                          ///< DOWN; if T3EX = 1, the timer counts UP.           
                                                                                                 
#define TMR3CF_T3OE__BMASK           0x02 ///< Timer Output Enable                               
#define TMR3CF_T3OE__SHIFT           0x01 ///< Timer Output Enable                               
#define TMR3CF_T3OE__OUTPUT_DISABLED 0x00 ///< Output of toggle mode not available at Timer's    
                                          ///< assigned port pin.                                
#define TMR3CF_T3OE__OUTPUT_ENABLED  0x02 ///< Output of toggle mode available at Timer's        
                                          ///< assigned port pin.                                
                                                                                                 
#define TMR3CF_TOG3__BMASK           0x04 ///< Toggle Output State                               
#define TMR3CF_TOG3__SHIFT           0x02 ///< Toggle Output State                               
#define TMR3CF_TOG3__NOT_SET         0x00 ///< Timer output is low. Set the timer output low.    
#define TMR3CF_TOG3__SET             0x04 ///< Timer output is high. Set the timer output high.  
                                                                                                 
#define TMR3CF_T3M__FMASK            0x18 ///< Timer Clock Mode Select                           
#define TMR3CF_T3M__SHIFT            0x03 ///< Timer Clock Mode Select                           
#define TMR3CF_T3M__SYSCLK_DIV_12    0x00 ///< System clock divided by 12.                       
#define TMR3CF_T3M__SYSCLK           0x08 ///< System clock.                                     
#define TMR3CF_T3M__EXTOSC_DIV_8     0x10 ///< External oscillator divided by 8 (synchronized    
                                          ///< with the system clock).                           
#define TMR3CF_T3M__SYSCLK_DIV_2     0x18 ///< System clock divided by 2.                        
                                                                                                 
//------------------------------------------------------------------------------
// TMR3CN Enums (Timer 3 Control @ 0xC8)
//------------------------------------------------------------------------------
#define TMR3CN_CPRL3__BMASK       0x01 ///< Capture/Reload Select                             
#define TMR3CN_CPRL3__SHIFT       0x00 ///< Capture/Reload Select                             
#define TMR3CN_CPRL3__AUTO_RELOAD 0x00 ///< Timer is in Auto-Reload Mode.                     
#define TMR3CN_CPRL3__CAPTURE     0x01 ///< Timer is in Capture Mode.                         
                                                                                              
#define TMR3CN_CT3__BMASK         0x02 ///< Counter/Timer Select                              
#define TMR3CN_CT3__SHIFT         0x01 ///< Counter/Timer Select                              
#define TMR3CN_CT3__TIMER         0x00 ///< Timer Function: Timer incremented by clock defined
                                       ///< by T3M.                                           
#define TMR3CN_CT3__COUNTER       0x02 ///< Counter Function: Timer incremented by high-to-low
                                       ///< transitions on external input pin.                
                                                                                              
#define TMR3CN_TR3__BMASK         0x04 ///< Timer 3 Run Control                               
#define TMR3CN_TR3__SHIFT         0x02 ///< Timer 3 Run Control                               
#define TMR3CN_TR3__STOP          0x00 ///< Stop Timer 3.                                     
#define TMR3CN_TR3__RUN           0x04 ///< Start Timer 3 running.                            
                                                                                              
#define TMR3CN_EXEN3__BMASK       0x08 ///< Timer 3 External Enable                           
#define TMR3CN_EXEN3__SHIFT       0x03 ///< Timer 3 External Enable                           
#define TMR3CN_EXEN3__DISABLED    0x00 ///< Transitions on the T3EX pin are ignored.          
#define TMR3CN_EXEN3__ENABLED     0x08 ///< Transitions on the T3EX pin cause capture, reload,
                                       ///< or control the direction of timer count (up or    
                                       ///< down).                                            
                                                                                              
#define TMR3CN_EXF3__BMASK        0x40 ///< Timer 3 External Flag                             
#define TMR3CN_EXF3__SHIFT        0x06 ///< Timer 3 External Flag                             
#define TMR3CN_EXF3__NOT_SET      0x00 ///< Timer 3 capture or reload did not occur.          
#define TMR3CN_EXF3__SET          0x40 ///< Timer 3 capture or reload occurred.               
                                                                                              
#define TMR3CN_TF3__BMASK         0x80 ///< Timer 3 Overflow/Underflow Flag                   
#define TMR3CN_TF3__SHIFT         0x07 ///< Timer 3 Overflow/Underflow Flag                   
#define TMR3CN_TF3__NOT_SET       0x00 ///< Timer 3 did not overflow or underflow.            
#define TMR3CN_TF3__SET           0x80 ///< Timer 3 overflowed or underflowed.                
                                                                                              
//------------------------------------------------------------------------------
// TMR3H Enums (Timer 3 High Byte @ 0xCD)
//------------------------------------------------------------------------------
#define TMR3H_TMR3H__FMASK 0xFF ///< Timer 3 High Byte
#define TMR3H_TMR3H__SHIFT 0x00 ///< Timer 3 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR3L Enums (Timer 3 Low Byte @ 0xCC)
//------------------------------------------------------------------------------
#define TMR3L_TMR3L__FMASK 0xFF ///< Timer 3 Low Byte
#define TMR3L_TMR3L__SHIFT 0x00 ///< Timer 3 Low Byte
                                                     
//------------------------------------------------------------------------------
// RCAP4H Enums (Timer 4 Capture Register High Byte @ 0xCB)
//------------------------------------------------------------------------------
#define RCAP4H_RCAP4L__FMASK 0xFF ///< Timer 4 Capture Register High Byte
#define RCAP4H_RCAP4L__SHIFT 0x00 ///< Timer 4 Capture Register High Byte
                                                                         
//------------------------------------------------------------------------------
// RCAP4L Enums (Timer 4 Capture Register Low Byte @ 0xCA)
//------------------------------------------------------------------------------
#define RCAP4L_RCAP4L__FMASK 0xFF ///< Timer 4 Capture Register Low Byte
#define RCAP4L_RCAP4L__SHIFT 0x00 ///< Timer 4 Capture Register Low Byte
                                                                        
//------------------------------------------------------------------------------
// TMR4CF Enums (Timer 4 Configuration @ 0xC9)
//------------------------------------------------------------------------------
#define TMR4CF_DCEN4__BMASK          0x01 ///< Decrement Enable                                  
#define TMR4CF_DCEN4__SHIFT          0x00 ///< Decrement Enable                                  
#define TMR4CF_DCEN4__DISABLED       0x00 ///< Timer will count up, regardless of the state of   
                                          ///< T4EX.                                             
#define TMR4CF_DCEN4__ENABLED        0x01 ///< Timer will count up or down depending on the state
                                          ///< of T4EX as follows: if T4EX = 0, the timer counts 
                                          ///< DOWN; if T4EX = 1, the timer counts UP.           
                                                                                                 
#define TMR4CF_T4OE__BMASK           0x02 ///< Timer Output Enable                               
#define TMR4CF_T4OE__SHIFT           0x01 ///< Timer Output Enable                               
#define TMR4CF_T4OE__OUTPUT_DISABLED 0x00 ///< Output of toggle mode not available at Timer's    
                                          ///< assigned port pin.                                
#define TMR4CF_T4OE__OUTPUT_ENABLED  0x02 ///< Output of toggle mode available at Timer's        
                                          ///< assigned port pin.                                
                                                                                                 
#define TMR4CF_TOG4__BMASK           0x04 ///< Toggle Output State                               
#define TMR4CF_TOG4__SHIFT           0x02 ///< Toggle Output State                               
#define TMR4CF_TOG4__NOT_SET         0x00 ///< Timer output is low. Set the timer output low.    
#define TMR4CF_TOG4__SET             0x04 ///< Timer output is high. Set the timer output high.  
                                                                                                 
#define TMR4CF_T4M__FMASK            0x18 ///< Timer Clock Mode Select                           
#define TMR4CF_T4M__SHIFT            0x03 ///< Timer Clock Mode Select                           
#define TMR4CF_T4M__SYSCLK_DIV_12    0x00 ///< System clock divided by 12.                       
#define TMR4CF_T4M__SYSCLK           0x08 ///< System clock.                                     
#define TMR4CF_T4M__EXTOSC_DIV_8     0x10 ///< External oscillator divided by 8 (synchronized    
                                          ///< with the system clock).                           
#define TMR4CF_T4M__SYSCLK_DIV_2     0x18 ///< System clock divided by 2.                        
                                                                                                 
//------------------------------------------------------------------------------
// TMR4CN Enums (Timer 4 Control @ 0xC8)
//------------------------------------------------------------------------------
#define TMR4CN_CPRL4__BMASK       0x01 ///< Capture/Reload Select                             
#define TMR4CN_CPRL4__SHIFT       0x00 ///< Capture/Reload Select                             
#define TMR4CN_CPRL4__AUTO_RELOAD 0x00 ///< Timer is in Auto-Reload Mode.                     
#define TMR4CN_CPRL4__CAPTURE     0x01 ///< Timer is in Capture Mode.                         
                                                                                              
#define TMR4CN_CT4__BMASK         0x02 ///< Counter/Timer Select                              
#define TMR4CN_CT4__SHIFT         0x01 ///< Counter/Timer Select                              
#define TMR4CN_CT4__TIMER         0x00 ///< Timer Function: Timer incremented by clock defined
                                       ///< by T4M.                                           
#define TMR4CN_CT4__COUNTER       0x02 ///< Counter Function: Timer incremented by high-to-low
                                       ///< transitions on external input pin.                
                                                                                              
#define TMR4CN_TR4__BMASK         0x04 ///< Timer 4 Run Control                               
#define TMR4CN_TR4__SHIFT         0x02 ///< Timer 4 Run Control                               
#define TMR4CN_TR4__STOP          0x00 ///< Stop Timer 4.                                     
#define TMR4CN_TR4__RUN           0x04 ///< Start Timer 4 running.                            
                                                                                              
#define TMR4CN_EXEN4__BMASK       0x08 ///< Timer 4 External Enable                           
#define TMR4CN_EXEN4__SHIFT       0x03 ///< Timer 4 External Enable                           
#define TMR4CN_EXEN4__DISABLED    0x00 ///< Transitions on the T4EX pin are ignored.          
#define TMR4CN_EXEN4__ENABLED     0x08 ///< Transitions on the T4EX pin cause capture, reload,
                                       ///< or control the direction of timer count (up or    
                                       ///< down).                                            
                                                                                              
#define TMR4CN_EXF4__BMASK        0x40 ///< Timer 4 External Flag                             
#define TMR4CN_EXF4__SHIFT        0x06 ///< Timer 4 External Flag                             
#define TMR4CN_EXF4__NOT_SET      0x00 ///< Timer 4 capture or reload did not occur.          
#define TMR4CN_EXF4__SET          0x40 ///< Timer 4 capture or reload occurred.               
                                                                                              
#define TMR4CN_TF4__BMASK         0x80 ///< Timer 4 Overflow/Underflow Flag                   
#define TMR4CN_TF4__SHIFT         0x07 ///< Timer 4 Overflow/Underflow Flag                   
#define TMR4CN_TF4__NOT_SET       0x00 ///< Timer 4 did not overflow or underflow.            
#define TMR4CN_TF4__SET           0x80 ///< Timer 4 overflowed or underflowed.                
                                                                                              
//------------------------------------------------------------------------------
// TMR4H Enums (Timer 4 High Byte @ 0xCD)
//------------------------------------------------------------------------------
#define TMR4H_TMR4H__FMASK 0xFF ///< Timer 4 High Byte
#define TMR4H_TMR4H__SHIFT 0x00 ///< Timer 4 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR4L Enums (Timer 4 Low Byte @ 0xCC)
//------------------------------------------------------------------------------
#define TMR4L_TMR4L__FMASK 0xFF ///< Timer 4 Low Byte
#define TMR4L_TMR4L__SHIFT 0x00 ///< Timer 4 Low Byte
                                                     
//------------------------------------------------------------------------------
// CKCON Enums (Clock Control @ 0x8E)
//------------------------------------------------------------------------------
#define CKCON_SCA__FMASK         0x03 ///< Timer 0/1 Prescale                            
#define CKCON_SCA__SHIFT         0x00 ///< Timer 0/1 Prescale                            
#define CKCON_SCA__SYSCLK_DIV_12 0x00 ///< System clock divided by 12.                   
#define CKCON_SCA__SYSCLK_DIV_4  0x01 ///< System clock divided by 4.                    
#define CKCON_SCA__SYSCLK_DIV_48 0x02 ///< System clock divided by 48.                   
#define CKCON_SCA__EXTOSC_DIV_8  0x03 ///< External oscillator divided by 8 (synchronized
                                      ///< with the system clock).                       
                                                                                         
