ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define CKCON_T0M__BMASK         0x08 ///< Timer 0 Clock Select                          
#define CKCON_T0M__SHIFT         0x03 ///< Timer 0 Clock Select                          
#define CKCON_T0M__PRESCALE      0x00 ///< Counter/Timer 0 uses the clock defined by the 
                                      ///< prescale field, SCA.                          
#define CKCON_T0M__SYSCLK        0x08 ///< Counter/Timer 0 uses the system clock.        
                                                                                         
#define CKCON_T1M__BMASK         0x10 ///< Timer 1 Clock Select                          
#define CKCON_T1M__SHIFT         0x04 ///< Timer 1 Clock Select                          
#define CKCON_T1M__PRESCALE      0x00 ///< Timer 1 uses the clock defined by the prescale
                                      ///< field, SCA.                                   
#define CKCON_T1M__SYSCLK        0x10 ///< Timer 1 uses the system clock.                
                                                                                         
//------------------------------------------------------------------------------
// TCON Enums (Timer 0/1 Control @ 0x88)
//------------------------------------------------------------------------------
#define TCON_IT0__BMASK   0x01 ///< Interrupt 0 Type Select               
#define TCON_IT0__SHIFT   0x00 ///< Interrupt 0 Type Select               
#define TCON_IT0__LEVEL   0x00 ///< /INT0 is level triggered, active low. 
#define TCON_IT0__EDGE    0x01 ///< /INT0 is edge triggered, falling-edge.
                                                                          
#define TCON_IE0__BMASK   0x02 ///< External Interrupt 0                  
#define TCON_IE0__SHIFT   0x01 ///< External Interrupt 0                  
#define TCON_IE0__NOT_SET 0x00 ///< Edge/level not detected.              
#define TCON_IE0__SET     0x02 ///< Edge/level detected                   
                                                                          
#define TCON_IT1__BMASK   0x04 ///< Interrupt 1 Type Select               
#define TCON_IT1__SHIFT   0x02 ///< Interrupt 1 Type Select               
#define TCON_IT1__LEVEL   0x00 ///< /INT1 is level triggered, active low. 
#define TCON_IT1__EDGE    0x04 ///< /INT1 is edge triggered, falling-edge.
                                                                          
#define TCON_IE1__BMASK   0x08 ///< External Interrupt 1                  
#define TCON_IE1__SHIFT   0x03 ///< External Interrupt 1                  
#define TCON_IE1__NOT_SET 0x00 ///< Edge/level not detected.              
#define TCON_IE1__SET     0x08 ///< Edge/level detected                   
                                                                          
#define TCON_TR0__BMASK   0x10 ///< Timer 0 Run Control                   
#define TCON_TR0__SHIFT   0x04 ///< Timer 0 Run Control                   
#define TCON_TR0__STOP    0x00 ///< Stop Timer 0.                         
#define TCON_TR0__RUN     0x10 ///< Start Timer 0 running.                
                                                                          
#define TCON_TF0__BMASK   0x20 ///< Timer 0 Overflow Flag                 
#define TCON_TF0__SHIFT   0x05 ///< Timer 0 Overflow Flag                 
#define TCON_TF0__NOT_SET 0x00 ///< Timer 0 did not overflow.             
#define TCON_TF0__SET     0x20 ///< Timer 0 overflowed.                   
                                                                          
#define TCON_TR1__BMASK   0x40 ///< Timer 1 Run Control                   
#define TCON_TR1__SHIFT   0x06 ///< Timer 1 Run Control                   
#define TCON_TR1__STOP    0x00 ///< Stop Timer 1.                         
#define TCON_TR1__RUN     0x40 ///< Start Timer 1 running.                
                                                                          
#define TCON_TF1__BMASK   0x80 ///< Timer 1 Overflow Flag                 
#define TCON_TF1__SHIFT   0x07 ///< Timer 1 Overflow Flag                 
#define TCON_TF1__NOT_SET 0x00 ///< Timer 1 did not overflow.             
#define TCON_TF1__SET     0x80 ///< Timer 1 overflowed.                   
                                                                          
//------------------------------------------------------------------------------
// TMOD Enums (Timer 0/1 Mode @ 0x89)
//------------------------------------------------------------------------------
#define TMOD_T0M__FMASK      0x03 ///< Timer 0 Mode Select                               
#define TMOD_T0M__SHIFT      0x00 ///< Timer 0 Mode Select                               
#define TMOD_T0M__MODE0      0x00 ///< Mode 0, 13-bit Counter/Timer                      
#define TMOD_T0M__MODE1      0x01 ///< Mode 1, 16-bit Counter/Timer                      
#define TMOD_T0M__MODE2      0x02 ///< Mode 2, 8-bit Counter/Timer with Auto-Reload      
#define TMOD_T0M__MODE3      0x03 ///< Mode 3, Two 8-bit Counter/Timers                  
                                                                                         
#define TMOD_CT0__BMASK      0x04 ///< Counter/Timer 0 Select                            
#define TMOD_CT0__SHIFT      0x02 ///< Counter/Timer 0 Select                            
#define TMOD_CT0__TIMER      0x00 ///< Timer Mode. Timer 0 increments on the clock       
                                  ///< defined by T0M in the CKCON register.             
#define TMOD_CT0__COUNTER    0x04 ///< Counter Mode. Timer 0 increments on high-to-low   
                                  ///< transitions of an external pin (T0).              
                                                                                         
#define TMOD_GATE0__BMASK    0x08 ///< Timer 0 Gate Control                              
#define TMOD_GATE0__SHIFT    0x03 ///< Timer 0 Gate Control                              
#define TMOD_GATE0__DISABLED 0x00 ///< Timer 0 enabled when TR0 = 1 irrespective of /INT0
                                  ///< logic level.                                      
#define TMOD_GATE0__ENABLED  0x08 ///< Timer 0 enabled only when TR0 = 1 and /INT0 is    
                                  ///< active.                                           
                                                                                         
#define TMOD_T1M__FMASK      0x30 ///< Timer 1 Mode Select                               
#define TMOD_T1M__SHIFT      0x04 ///< Timer 1 Mode Select                               
#define TMOD_T1M__MODE0      0x00 ///< Mode 0, 13-bit Counter/Timer                      
#define TMOD_T1M__MODE1      0x10 ///< Mode 1, 16-bit Counter/Timer                      
#define TMOD_T1M__MODE2      0x20 ///< Mode 2, 8-bit Counter/Timer with Auto-Reload      
#define TMOD_T1M__MODE3      0x30 ///< Mode 3, Timer 1 Inactive                          
                                                                                         
#define TMOD_CT1__BMASK      0x40 ///< Counter/Timer 1 Select                            
#define TMOD_CT1__SHIFT      0x06 ///< Counter/Timer 1 Select                            
#define TMOD_CT1__TIMER      0x00 ///< Timer Mode. Timer 1 increments on the clock       
                                  ///< defined by T1M in the CKCON register.             
#define TMOD_CT1__COUNTER    0x40 ///< Counter Mode. Timer 1 increments on high-to-low   
                                  ///< transitions of an external pin (T1).              
                                                                                         
#define TMOD_GATE1__BMASK    0x80 ///< Timer 1 Gate Control                              
#define TMOD_GATE1__SHIFT    0x07 ///< Timer 1 Gate Control                              
#define TMOD_GATE1__DISABLED 0x00 ///< Timer 1 enabled when TR1 = 1 irrespective of /INT1
                                  ///< logic level.                                      
#define TMOD_GATE1__ENABLED  0x80 ///< Timer 1 enabled only when TR1 = 1 and /INT1 is    
                                  ///< active.                                           
                                                                                         
//------------------------------------------------------------------------------
// SADDR0 Enums (UART0 Slave Address @ 0xA9)
//------------------------------------------------------------------------------
#define SADDR0_SADDR0__FMASK 0xFF ///< UART0 Slave Address
#define SADDR0_SADDR0__SHIFT 0x00 ///< UART0 Slave Address
                                                          
//------------------------------------------------------------------------------
// SADEN0 Enums (UART0 Slave Address Enable @ 0xB9)
//------------------------------------------------------------------------------
#define SADEN0_SADEN0__FMASK 0xFF ///< UART0 Slave Address Enable
#define SADEN0_SADEN0__SHIFT 0x00 ///< UART0 Slave Address Enable
                                                                 
//------------------------------------------------------------------------------
// SBUF0 Enums (UART0 Serial Port Data Buffer @ 0x99)
//------------------------------------------------------------------------------
#define SBUF0_SBUF0__FMASK 0xFF ///< Serial Data Buffer
#define SBUF0_SBUF0__SHIFT 0x00 ///< Serial Data Buffer
                                                       
//------------------------------------------------------------------------------
// SCON0 Enums (UART0 Serial Port Control @ 0x98)
//------------------------------------------------------------------------------
#define SCON0_RI__BMASK             0x01 ///< Receive Interrupt Flag                           
#define SCON0_RI__SHIFT             0x00 ///< Receive Interrupt Flag                           
#define SCON0_RI__NOT_SET           0x00 ///< A byte of data has not been received by UART0.   
#define SCON0_RI__SET               0x01 ///< UART0 received a byte of data.                   
                                                                                               
