ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define SCON0_TI__BMASK             0x02 ///< Transmit Interrupt Flag                          
#define SCON0_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                          
#define SCON0_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART0.
#define SCON0_TI__SET               0x02 ///< UART0 transmitted a byte of data.                
                                                                                               
#define SCON0_RB8__BMASK            0x04 ///< Ninth Receive Bit                                
#define SCON0_RB8__SHIFT            0x02 ///< Ninth Receive Bit                                
#define SCON0_RB8__CLEARED_TO_0     0x00 ///< In Mode 0, the STOP bit was 0. In Mode 1, the 9th
                                         ///< bit was 0.                                       
#define SCON0_RB8__SET_TO_1         0x04 ///< In Mode 0, the STOP bit was 1. In Mode 1, the 9th
                                         ///< bit was 1.                                       
                                                                                               
#define SCON0_TB8__BMASK            0x08 ///< Ninth Transmission Bit                           
#define SCON0_TB8__SHIFT            0x03 ///< Ninth Transmission Bit                           
#define SCON0_TB8__CLEARED_TO_0     0x00 ///< In Mode 1, set the 9th transmission bit to 0.    
#define SCON0_TB8__SET_TO_1         0x08 ///< In Mode 1, set the 9th transmission bit to 1.    
                                                                                               
#define SCON0_REN__BMASK            0x10 ///< Receive Enable                                   
#define SCON0_REN__SHIFT            0x04 ///< Receive Enable                                   
#define SCON0_REN__RECEIVE_DISABLED 0x00 ///< UART0 reception disabled.                        
#define SCON0_REN__RECEIVE_ENABLED  0x10 ///< UART0 reception enabled.                         
                                                                                               
#define SCON0_SM2__BMASK            0x20 ///< Multiprocessor Communication Enable              
#define SCON0_SM2__SHIFT            0x05 ///< Multiprocessor Communication Enable              
#define SCON0_SM2__MULTI_DISABLED   0x00 ///< Multiprocessor communication disabled.           
#define SCON0_SM2__MULTI_ENABLED    0x20 ///< Multiprocessor communication enabled.            
                                                                                               
#define SCON0_SM__FMASK             0xC0 ///< Serial Port 0 Operation Mode                     
#define SCON0_SM__SHIFT             0x06 ///< Serial Port 0 Operation Mode                     
#define SCON0_SM__MODE0             0x00 ///< Mode 0: Sychronous Mode                          
#define SCON0_SM__MODE1             0x40 ///< Mode 1: 8-bit UART, Variable Baud Rate           
#define SCON0_SM__MODE2             0x80 ///< Mode 2: 9-bit UART, Fixed Baud Rate              
#define SCON0_SM__MODE3             0xC0 ///< Mode 3: 9-bit UART, Variable Baud Rate           
                                                                                               
//------------------------------------------------------------------------------
// SSTA0 Enums (UART0 Status and Clock Selection @ 0x91)
//------------------------------------------------------------------------------
#define SSTA0_S0RCLK__FMASK          0x03 ///< UART0 Receive Baud Rate Clock Selection        
#define SSTA0_S0RCLK__SHIFT          0x00 ///< UART0 Receive Baud Rate Clock Selection        
#define SSTA0_S0RCLK__TIMER1         0x00 ///< Timer 1 generates UART0 RX baud rate.          
#define SSTA0_S0RCLK__TIMER2         0x01 ///< Timer 2 overflow generates UART0 RX baud rate. 
#define SSTA0_S0RCLK__TIMER3         0x02 ///< Timer 3 overflow generates UART0 RX baud rate. 
#define SSTA0_S0RCLK__TIMER4         0x03 ///< Timer 4 overflow generates UART0 RX baud rate. 
                                                                                              
#define SSTA0_S0TCLK__FMASK          0x0C ///< UART0 Transmit Baud Rate Clock Selection       
#define SSTA0_S0TCLK__SHIFT          0x02 ///< UART0 Transmit Baud Rate Clock Selection       
#define SSTA0_S0TCLK__TIMER1         0x00 ///< Timer 1 generates UART0 TX baud rate.          
#define SSTA0_S0TCLK__TIMER2         0x04 ///< Timer 2 overflow generates UART0 TX baud rate. 
#define SSTA0_S0TCLK__TIMER3         0x08 ///< Timer 3 overflow generates UART0 TX baud rate. 
#define SSTA0_S0TCLK__TIMER4         0x0C ///< Timer 4 overflow generates UART0 TX baud rate. 
                                                                                              
#define SSTA0_SMOD__BMASK            0x10 ///< UART0 Baud Rate Doubler Enable                 
#define SSTA0_SMOD__SHIFT            0x04 ///< UART0 Baud Rate Doubler Enable                 
#define SSTA0_SMOD__DOUBLER_DISABLED 0x00 ///< UART0 baud rate divide-by-two enabled (doubler 
                                          ///< disabled).                                     
#define SSTA0_SMOD__DOUBLER_ENABLED  0x10 ///< UART0 baud rate divide-by-two disabled (doubler
                                          ///< enabled).                                      
                                                                                              
#define SSTA0_TXCOL__BMASK           0x20 ///< Transmit Collision Flag                        
#define SSTA0_TXCOL__SHIFT           0x05 ///< Transmit Collision Flag                        
#define SSTA0_TXCOL__NOT_SET         0x00 ///< Transmission collision has not been detected.  
#define SSTA0_TXCOL__SET             0x20 ///< Transmission collision has been detected.      
                                                                                              
#define SSTA0_RXOV__BMASK            0x40 ///< Receive Overrun Flag                           
#define SSTA0_RXOV__SHIFT            0x06 ///< Receive Overrun Flag                           
#define SSTA0_RXOV__NOT_SET          0x00 ///< Receive overrun has not been detected.         
#define SSTA0_RXOV__SET              0x40 ///< Receive overrun has been detected.             
                                                                                              
#define SSTA0_FE__BMASK              0x80 ///< Frame Error Flag                               
#define SSTA0_FE__SHIFT              0x07 ///< Frame Error Flag                               
#define SSTA0_FE__NOT_SET            0x00 ///< Frame Error has not been detected              
#define SSTA0_FE__SET                0x80 ///< Frame Error has been detected.                 
                                                                                              
//------------------------------------------------------------------------------
// SBUF1 Enums (UART1 Serial Port Data Buffer @ 0x99)
//------------------------------------------------------------------------------
#define SBUF1_SBUF1__FMASK 0xFF ///< Serial Data Buffer
#define SBUF1_SBUF1__SHIFT 0x00 ///< Serial Data Buffer
                                                       
//------------------------------------------------------------------------------
// SCON1 Enums (UART1 Serial Port Control @ 0x98)
//------------------------------------------------------------------------------
#define SCON1_RI__BMASK             0x01 ///< Receive Interrupt Flag                           
#define SCON1_RI__SHIFT             0x00 ///< Receive Interrupt Flag                           
#define SCON1_RI__NOT_SET           0x00 ///< A byte of data has not been received by UART1.   
#define SCON1_RI__SET               0x01 ///< UART1 received a byte of data.                   
                                                                                               
