ahtn/keyplus/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Register_Enums.h
#define SCON1_TI__BMASK             0x02 ///< Transmit Interrupt Flag                          
#define SCON1_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                          
#define SCON1_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART1.
#define SCON1_TI__SET               0x02 ///< UART1 transmitted a byte of data.                
                                                                                               
#define SCON1_RB8__BMASK            0x04 ///< Ninth Receive Bit                                
#define SCON1_RB8__SHIFT            0x02 ///< Ninth Receive Bit                                
#define SCON1_RB8__CLEARED_TO_0     0x00 ///< In Mode 0, the STOP bit was 0. In Mode 1, the 9th
                                         ///< bit was 0.                                       
#define SCON1_RB8__SET_TO_1         0x04 ///< In Mode 0, the STOP bit was 1. In Mode 1, the 9th
                                         ///< bit was 1.                                       
                                                                                               
#define SCON1_TB8__BMASK            0x08 ///< Ninth Transmission Bit                           
#define SCON1_TB8__SHIFT            0x03 ///< Ninth Transmission Bit                           
#define SCON1_TB8__CLEARED_TO_0     0x00 ///< In Mode 1, set the 9th transmission bit to 0.    
#define SCON1_TB8__SET_TO_1         0x08 ///< In Mode 1, set the 9th transmission bit to 1.    
                                                                                               
#define SCON1_REN__BMASK            0x10 ///< Receive Enable                                   
#define SCON1_REN__SHIFT            0x04 ///< Receive Enable                                   
#define SCON1_REN__RECEIVE_DISABLED 0x00 ///< UART1 reception disabled.                        
#define SCON1_REN__RECEIVE_ENABLED  0x10 ///< UART1 reception enabled.                         
                                                                                               
#define SCON1_MCE__BMASK            0x20 ///< Multiprocessor Communication Enable              
#define SCON1_MCE__SHIFT            0x05 ///< Multiprocessor Communication Enable              
#define SCON1_MCE__MULTI_DISABLED   0x00 ///< Ignore level of 9th bit / Stop bit.              
#define SCON1_MCE__MULTI_ENABLED    0x20 ///< RI is set and an interrupt is generated only when
                                         ///< the stop bit is logic 1 (Mode 0) or when the 9th 
                                         ///< bit is logic 1 (Mode 1).                         
                                                                                               
#define SCON1_SMODE__BMASK          0x80 ///< Serial Port 0 Operation Mode                     
#define SCON1_SMODE__SHIFT          0x07 ///< Serial Port 0 Operation Mode                     
#define SCON1_SMODE__8_BIT          0x00 ///< 8-bit UART with Variable Baud Rate (Mode 0).     
#define SCON1_SMODE__9_BIT          0x80 ///< 9-bit UART with Variable Baud Rate (Mode 1).     
                                                                                               
//------------------------------------------------------------------------------
// REF0CN Enums (Voltage Reference Control @ 0xD1)
//------------------------------------------------------------------------------
#define REF0CN_REFBE__BMASK         0x01 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__SHIFT         0x00 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__REF_DISABLED  0x00 ///< Internal reference buffer off.                    
#define REF0CN_REFBE__REF_ENABLED   0x01 ///< Internal reference buffer on. The internal voltage
                                         ///< reference is driven on the VREF pin.              
                                                                                                
#define REF0CN_BIASE__BMASK         0x02 ///< ADC/DAC Bias Generator Enable                     
#define REF0CN_BIASE__SHIFT         0x01 ///< ADC/DAC Bias Generator Enable                     
#define REF0CN_BIASE__BIAS_DISABLED 0x00 ///< Internal bias generator off.                      
#define REF0CN_BIASE__BIAS_ENABLED  0x02 ///< Internal bias generator on.                       
                                                                                                
#define REF0CN_TEMPE__BMASK         0x04 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__SHIFT         0x02 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__TEMP_DISABLED 0x00 ///< Disable the Temperature Sensor.                   
#define REF0CN_TEMPE__TEMP_ENABLED  0x04 ///< Enable the Temperature Sensor.                    
                                                                                                
#define REF0CN_AD2VRS__BMASK        0x08 ///< ADC2 Voltage Reference Select                     
#define REF0CN_AD2VRS__SHIFT        0x03 ///< ADC2 Voltage Reference Select                     
#define REF0CN_AD2VRS__VREF2_PIN    0x00 ///< ADC2 voltage reference from VREF2 pin.            
#define REF0CN_AD2VRS__AV_PLUS      0x08 ///< ADC2 voltage reference from AV+.                  
                                                                                                
#define REF0CN_REFSL__FMASK         0x18 ///< Voltage Reference Select                          
#define REF0CN_REFSL__SHIFT         0x03 ///< Voltage Reference Select                          
#define REF0CN_REFSL__VREF_PIN      0x00 ///< The ADC0 voltage reference is the P0.0/VREF pin.  
#define REF0CN_REFSL__VDD_PIN       0x08 ///< The ADC0 voltage reference is the VDD pin.        
#define REF0CN_REFSL__INTERNAL_LDO  0x10 ///< The ADC0 voltage reference is the internal 1.8 V  
                                         ///< digital supply voltage.                           
#define REF0CN_REFSL__INTERNAL_VREF 0x18 ///< The ADC0 voltage reference is the internal voltage
                                         ///< reference.                                        
                                                                                                
